{
   
    "top_nav_kalamata": "Aristomenous 79 road, Kalamata, 24100",
    "email": "smilemakeover4u@gmail.com",

  
    "mid_nav_call": "Call Today:",
    "mid_nav_time_p": "Open Hours:",
    "mid_nav_time": "09:00 AM to 18:00 PM",

    "footer_links":"Useful Links",
    "footer_contact":"Contact Us:",
    "footer_location":"Our Location:",
    "footer_call":"Call Today:",
    "footer_time_p":"Open Hours:",
    "footer_time":"09:00 AM to 18:00 PM",
    "footer_ceo":"CEO & Founder",
    


    "nav_home_main": "HOME PAGE",
    "nav_team": "Our Team",
    "nav_clinic":"Our Clinic",
    "nav_services": "Services",
    "nav_services_implants": "Implants Solution",
    "nav_services_cdentistry": "Cosmetic Dentistry",
    "nav_before_after":"Before & After",
    "nav_dental_tourism":"Dental Tourism",
    "nav_prices":"Prices",
    "nav_contact":"Contact Us",
    "nav_blog":"Blog",
    "nav_testimonials":"Testimonials",
    "nav_allx":"All-On-X System",
    "nav_implants":"Dental Implants",
    "nav_rehab":"Full Mouth Rehabilitation",
    "nav_cosmetic_dentistry":"Cosmetic Dentistry",
    "nav_hsmile":"Hollywood Smile",
    "nav_whitening":"Teeth Whitening",
    "nav_orthodontics":"Invisible Orthodontics",
    "nav_veneers":"Dental Veneers",
    "nav_veneers_porcelain":"Porcelain",
    "nav_veneers_resin":"Composite Resin",
    "nav_prosthetic_dentistry":"Prosthetic Dentistry",
    "nav_prosthetics_fixed":"Fixed Prosthodontics ",
    "nav_prosthetics_mobile":"Mobile Prosthodontics ",
    "nav_prosthetics_min_rehab":"Minimal Intervention Rehabilitation",
    "nav_zcrowns":"Zirconia Crowns",
    "nav_zbridges":"Zirconia Bridges",
    "nav_denture":"Denture",
    "nav_prosthetics_lays":"Inlays - Onlays",
    "nav_facial":"Facial Aesthetics",
    "nav_facial_botox_face_improvement":"Face Enhancement",
    "nav_facial_botox_etc":"Hyaluronic Acid, Vitamins & Botox",
    "nav_facial_prp":"PRP Treatment",
    "nav_facial_altetnative":"Alternative Cure",
    "nav_periodontology":"Periodontology",
    "nav_orofacial":"Orofacial Pain",


    "button_view_all":"More",
    "button_read_more":"Read More",

    "services_main_page_span":" Our Dental Services",
    "services_main_page_h2":"Our Services",


    "form_fname":"First Name",
    "form_lname":"Last Name",
    "form_phone":"Phone",
    "form_email":"Email",
    "form_message":"Your Message",
    "form_send":"Send Message",
  

    "all_dentists": "Μedical Staff",
    "all_dental_technician": "Dental Technicians",
    "all_office_staff": "Office Staff",
    
    "general_qualification":"Qualification:",
    "general_certification":"Certification:",
    "general_skills":"Professional Skills:",
    "general_education":"Education:",
    "general_awards":"Awards:",

    "testimonials_mainpage_span":"Our Clients Reviews",
    "testimonials_mainpage_title":"Recent Reviews From Our Clients",

    
    "testimonials_button_recent":"Recent",
    "testimonials_button_highest":"Highest",
    "testimonials_button_lower":"Lowest",

    "our_dentists_home_page_span":"Our Dentists",
    "our_dentists_home_page_h2":"Our Specialized and Experienced Dentists",
    
    "our_team_page_welcome":"Welcome to Our Team!",
    "our_team_page_welcome_p":"Our team of doctors and ceramists combine an artist’s eye with a scientist’s precision. The exceptional care the whole team of doctors and assistants provide make every patient’s smile journey truly unique!",

    "our_team_span":"Our Dentists",
    "our_team_h2":"Our Specialized and Experienced Dentists",

    "our_team_tsetsenekou":"Dr.Tsetsenekou Efstathia",
    "our_team_labropoulou":"Dr.Labropoulou Katerina",
    "our_team_dimakis":"Dr.Dimakis Georgios",
    "our_team_vosiki":"Ms.Vosiki Giota",
    "our_team_iliopoulou":"Ms.Iliopoulou Natasa",

    "general_birthday_title":"Birthday:",
    "general_specialized_title":"Specialization in:",
    "general_education_title":"Education:",
    "general_member_title":"Member of:",

    
    "tsetstenekou_birthday":"12/02/1976",
    "tsetstenekou_specialized":"Oral Surgeon",
    "tsetstenekou_education":"DDS, MSc, PhD, Postdoc from University of Athens.",
    "tsetstenekou_member":"Member of General Dental Council (Gr) Hellenic Society of Biomaterials, European Association for Osseointegration, Hellenic Society of Oral Surgery and Hellenic Association of Dental and Maxillofacial Radiology",
    "tsetsenekou_summary":"Efstathia Tsetsenekou was born in Athens in 1976. She was accepted at the University of Athens in 1995 in the Faculty of Dentistry. After graduating, she worked as a general dentist in a private clinic, while continuing the second cycle of her studies on the Oral and Maxillofacial Surgery Department of the Dental Faculty, where she obtained a Master’s Degree in Oral Pathobiology with clinical specialization in Oral Surgery. She completed her doctoral thesis in the field of Osseointegrated implants with excellence and continued with post-doctoral research in the field of oral grafts.  She had been a research associate in the Department of Oral Surgery in the Faculty Dentistry for ten years (2004-2014) and had a paid position as a postdoctoral researcher in the Department of Biomaterials from 2013 to 2015. Participation in national and international conferences is active with presentations and issue of medical papers, while seamless is the writing and publication of scientific articles. She is a member of the Greek Society of Biomaterials and of the European Academy of Osseointegration. Her personal interests are: Greek dances, martial arts, opera and tennis!",

    "dimakis_birthday":"19/05/1970",
    "dimakis_specialized":"Periodontist & Implantologist",
    "dimakis_education":"DDS (University of Athens), MSc (Gothenburg, University of Sweden), Postgraduate Diploma in Periodontology and Implantology",
    "dimakis_member":"the  General Dental Council (UK) & (GR)",
    "dimakis_summary":"George received extensive training in advanced gum care (periodontal therapy) and provision of dental implants. Having placed over 4,000 implants during the last 20 years, he specialises in complex implant treatment including All-on-4®, teeth in a day and sinus lift surgery. George trained with Professor Branemark, the founder of dental implants in Sweden and is a visiting faculty member of the University of Gothenburg. In his personal times George enjoys cooking and windsurfing and is extremely proud father of 2 teenagers.",

    "labropoulou_birthday":"28/05/1971",
    "labropoulou_specialized":"Anesthesiology.",
    "labropoulou_education":"MD(University of Athens), MSc in Anesthesiology",
    "labropoulou_member":"the Hellenic Society of Algology & Hellenic Society of Anaesthesiology",
    "labropoulou_summary":"Katerina Lampropoulou was born in Kalamata. She is a graduate of the Athens Medical School and completed her anesthesiology practice at the Hippocratic Hospital of Athens. She worked as a curator for six years at the General Hospital of Kalamata and currently works as a freelancer in the mixed surgical clinic Messinian LITT Treatment Center. She is a PhD student at the Medical School of the University of Athens, specializing in chronic pain. Katerina has been a lecturer in Algorithm Continuing Education since 2010 and has numerous publications and papers in both national and international journals and conferences. She has contributed to the guidelines of the Panhellenic Anesthesiological Society. Additionally, she is a University Scholar at the Nursing University of Sparta, where she is responsible for the Nursing Anesthesiology course. She serves as the president of the Medical Society of Messinia and is a member of the Hellenic Association of Algology and the Panhellenic Anesthesiological Society. At her personal time she enjoys practising yoga and graphic design!",

    "all_staff_iliopoulou_spec": "Nurse-Dental Assistant",
    "iliopoulou_birthday":"23/08/1987",
    "iliopoulou_specialized":"Nursery",
    "iliopoulou_education":"Assistant Microbiology & Nursery",
    "iliopoulou_summary":"Mrs Iliopoulou was born in 1987. She graduated as a nurse and assistant microbiologist in 2005. She has been working as a nurse since then. Natasa assists all our surgery procedures in our clinic.",

    "all_staff_vosiki_spec": "Office Staff",
    "vosiki_birthday":"18/04/1978",
    "vosiki_specialized":"Treatment Coordinator",
    "vosiki_education":"Assistant Accountant",
    "vosiki_summary":"Panagiota Voziki was born in Athens in 1978. After graduating from high school, she acquainted on expertise in general accounting. Her first professional experience was in the HR department of the company AVAX S.A. constructions. During her employment as an executive secretary in a technical office of public constructions she developed her skills in the field of personal relationships. In our clinic, her current responsibilities concern the assurance of patient’s privacy, the accuracy of their appointments and the organization of medical office.",

    "aboutUsHomePage_span":"About our Clinic!",
    "aboutUsHomePage_h2":"Welcome to Smile Make Over!",
    "aboutUsHomePage_p":"Our philosophy is based on the belief that the oral cavity not only serves as a survival tool, but also as a means of communication, expression and quality of life performance. The services offered at both our clinics concern the prevention and treatment of the Oro-maxillofacial System on the whole, focusing each time on the special needs of the patient, thus personalizing the treatment plan.",
    "aboutUsHomePage_title_ul":"Specifically:",
    "aboutUsHomePage_ul_li_1":"Permanent and natural-looking replacement for missing teeth.",
    "aboutUsHomePage_ul_li_2":"Full-arch restoration with just 4 to 6 implants.",
    "aboutUsHomePage_ul_li_3":"Fixed, non-removable prosthesis for a complete smile makeover.",
    "aboutUsHomePage_ul_li_4":"Aesthetic color change interventions and tooth shape (whitening, veneers, smile aligners)",
    "aboutUsHomePage_p_end":"Your Smile, Our Priority!",

    "services_main_title":"Welcome to our Services",
    "services_main_p":"At Smile Make Over Clinic, we provide a full range of dental services, from preventive care to cosmetic and restorative treatments. Our expert team uses the latest techniques and technologies to ensure your smile is both healthy and beautiful, with your comfort and satisfaction as our top priorities.",
    "services_main_allx_p":"Regain your full smile with the All-On-X system, offering All-on-4 or All-on-6 options. This advanced dental technique uses four or six implants to support a permanent, natural-looking set of teeth, providing maximum comfort, stability, and a beautifully restored smile.",
    "services_main_implants_p":"Revitalize your smile with our advanced dental implants. From precise placement to natural-looking crowns, our expert team ensures a seamless process for single, multiple, or full-tooth restoration. Regain confidence and functionality—schedule your personalized consultation today!",
    "services_main_mouthRehab_p":"Revitalize your smile with our full mouth rehabilitation services. Our personalized approach addresses oral health concerns, offering a comprehensive range of treatments, from restorations to cosmetic enhancements. Experience optimal functionality and lasting results with our skilled team. Unveil a renewed, confident smile with our transformative full mouth rehabilitation.",
    "services_main_zcrowns_veneers_p":"Transform your smile with custom-made veneers and durable zirconia crowns. These cosmetic solutions provide a natural, flawless look, enhancing both the function and beauty of your teeth.",
    "services_main_hsmile_p":"Discover your Hollywood smile at our cutting-edge dental clinic. With expert care and advanced techniques, we'll transform your teeth into a radiant masterpiece. Schedule your appointment today!",
    "services_main_whitening_p":"Brighten your smile effortlessly with our teeth whitening services. Our professional treatment effectively removes stains and discoloration, leaving your teeth noticeably whiter and brighter. Achieve a radiant, confident smile in no time. Schedule your teeth whitening session for a dazzling transformation!",
    "services_main_denture_p":"Rediscover confidence in your smile with our custom dentures. Carefully crafted to fit your unique dental structure, our dentures offer comfort and functionality. Say goodbye to discomfort and hello to a natural-looking smile that restores your confidence. Schedule a consultation today and embark on the journey towards a vibrant, new smile with our personalized denture solutions.",
    "services_main_lays_p":"Experience dental restoration at its finest with our precision-crafted onlays. Designed to seamlessly blend with your natural teeth, our onlays provide durable and long-lasting solutions for tooth restoration. Restore both function and aesthetics to your smile with confidence. Reach out to us today to learn more about how our customized onlay solutions can revitalize your dental health effortlessly.",
    "services_main_p_sedation":"With pleasure, we offer Conscious Sedation as part of our dental services, ensuring your comfort and relaxation during procedures. Prioritizing safety and efficiency, our clinic provides optimal care for your dental needs. For more information, click",
    "services_main_p_here":"here",


    
    "conscious_sedation_title":"Conscious Sedation",
    "conscious_sedation_p":"Our clinics give patients the opportunity to undergo conscious sedation by anesthesiologist in a specifically equipped environment. It is an absolutely safe procedure that takes place by intravenous administrated medication, while monitoring vital signs.",
    "conscious_sedation_cases_title":"In which situations should this procedure be proposed?",
    "conscious_sedation_cases_p":"When long hours surgery is about to take place i.e. placing 10-12 dental implants in maxilla and mandible, or even smaller-scale operation is scheduled i.e. extraction of wisdom teeth, although there is no pain, patient memorizes negatively the experience since he is severely stressed during the procedure. On the contrary, when sedated the patient is both psychologically and mentally relaxed.",
    "conscious_sedation_cases_p1":"Although communication with the doctor is seamless, the patient has no time-stress and leaves the clinic with a pleasant memory of the procedure. On the other hand, avoiding general anesthesia gives him the comfort to get back to his social and professional activities without any delay that possible side effects may cause.",
    "conscious_sedation_guide_title":"Instructions",
    "conscious_sedation_guide_p":"Preparation at home – Diet:",
    "conscious_sedation_guide_li_3":"For adults, there are no specific requirements:",
    "conscious_sedation_guide_p_3":"Avoid liquids 2-3 hours before and food 4 hours before the procedure.",
    "conscious_sedation_guide_after_title":"Post-operative instructions for Conscious sedation:",
    "conscious_sedation_guide_after_p1":"Do not drive for 24 hours after the treatment or make important decisions.",
    "conscious_sedation_guide_after_p2":"Do not consume food or liquids for the first 2 hours after the procedure.",
    "conscious_sedation_guide_after_p3":"Avoid using dangerous devices.",
    "conscious_sedation_guide_after_p4":"Do not lift heavy weights or climb stairs.",
    "conscious_sedation_guide_after_p":"The effect of the medication is intense for approximately 2 hours post-surgery, and the half-life is 6-8 hours.",



    "full_rehab_p":"Transform your smile with our Full Mouth Rehabilitation services! Our expert team at Smile Make Over specializes in comprehensive dental care, addressing a range of concerns from missing teeth to bite issues. Using advanced technology and personalized treatment plans, we aim to restore both function and aesthetics to your entire mouth. Experience the benefits of improved oral health, enhanced aesthetics, and renewed self-confidence. Schedule a consultation with us today, and let's embark on the journey to your radiant smile together.",
    
   "zircven_page_title":"Veneers & Zirconia Crowns",
   "zircven_page_p":"From creating the world's finest veneers and crowns that perfectly mimic natural teeth to our unique process of achieving facial harmony through the smile, our team of dentists and ceramists at Smile Make Over combine an artist's eye with a scientist's precision. The exceptional care we provide makes each client's smile journey truly unique.",
   "zircven_page_title1":"What are E.MAX®️ and Zirconia ?",
   "zircven_page_p1":"E.max® and zirconia veneers are the miracles that will turn your self-conscious feelings into full-blown confidence. They are made of ultra-thin glass ceramic permanently bonded to your natural tooth enamel. It’s used to enhance whole smiles in what is known as a Smile Makeover or Hollywood Smile and creates the smiles of many celebrities worldwide. These ceramics are so unique because it is both strong and aesthetic. It provides a natural look, superior durability, and is highly stain-resistant. Over the past few years, there has been an increased demand for metal-free restorations. Patients have become more concerned about the presence of metal in their mouths and want to receive the most aesthetically pleasing restorations. This demand has been accommodated with the introduction of newer and stronger ceramics such as zirconia and e.max®, replacing older style feldspathic and leucite-based restorations. These materials offer superior strength and fit, combined with excellent aesthetics. Over the past decade, the companies providing metal-free ceramics have continually updated their products. The latest generation of materials provides improved opalescence, combined with lifelike shades and translucencies. All-ceramic restorations are healthier for gum tissues and provide long-lasting and reliable results. The lack of metal results in zero darkness around the gum margins, and light is transmitted through these materials in a way that closely replicates a natural tooth.",
  


   "zircven_sidebar_title":"Can you get zirconia veneers in a more natural colour/not so white ?",
   "zircven_sidebar_title1":"What is E.max® and what are it's benefits ?",
   "zircven_sidebar_title2":"What can i eat and drink with veneers ?",
   "zircven_sidebar_title3":"Can veneers fall off ?",
   "zircven_sidebar_title4":"How long do E.MAX®️ and Zirconia veneers last ?",
  
    "blog_zircven_natural_color_p":"Zirconia is sometimes described as being like white metal, and its flexural strength makes it easy as strong as traditional PFMs. Solid Zirconia restorations are often ideal for people with bruxism. They are fabricated using CAD/CAM technology, resulting in an excellent marginal fit, reducing chair-time and the risk of remakes. Originally, zirconia was only available in its natural white colour.",
    "blog_zircven_benefits_p":"This is a pressed or milled lithium disilicate material. It is not quite as strong as zirconia but is three times stronger than your natural teeth. It is available in a huge range of translucencies and shades. Our master dental technicians can produce full-contour restorations, or these can be cut back and layered with porcelain to enhance the aesthetic effects.",
    "blog_zircven_drink_eat_p":"You can eat and drink anything you want with e.max®️ and zirconia veneers! For the first few weeks, you may experience some sensitivity, and we advise you to chop your crunchy foods into smaller, bite-sized portions until you get used to eating with your new veneers. We recommend you avoid biting the front of your teeth and look after your new smile as you would your old one – with love, care, and good oral hygiene.",
    "blog_zircven_fall_p":"Yes, they may. There are various reasons why veneers break off and fall off or get damaged. Here are some of them:",
    "blog_zircven_fall_p1":"This is a pressed or milled lithium disilicate material. It is not quite as strong as zirconia but is three times stronger than your natural teeth. It is available in a huge range of translucencies and shades. Our master dental technicians can produce full-contour restorations, or these can be cut back and layered with porcelain to enhance the aesthetic effects.",
    "blog_zircven_fall_p2":"Age of veneers – The primary reason is the age of the veneers. Porcelain veneers should last at least 10 – 15+ years. But conservatively speaking, veneer lasts for more than 15 years. As time passes, the veneers get slowly detached from the teeth as the adhesive bonding gets weakened over a period of time, making the veneers come loose and fall off.",
    "blog_zircven_fall_p3":"Poor adhesive – The second most common reason is that the bonding agent used for the veneer to stick on teeth was not of prime quality in the first place. Either enough time was given for adhesive bonding to take place, or the technique was not proper. In either, it is a problem of the dentist, not of veneers.",
    "blog_zircven_fall_p4":"Tooth decay – The other common reason is when the teeth on which veneers are placed get decayed. There are many reasons for tooth decay. It happens because of lifestyle choices and, in some cases, because of the effects of prescription drugs that some individuals cannot escape.",
    "blog_zircven_fall_p5":"Teeth grinding – One more common reason is the patients’ habit of grinding teeth during sleep, or bruxism, for either physical or psychological reasons. If bruxism occurs regularly, the force on veneers is great. Veneers cannot hold up to the pressure on the inside edge and may chip, break, or get damaged.",
    "blog_zircven_fall_p6":"Lack of proper care – Negligence is another common reason veneers fall or break off. Veneers are delicate devices which require good oral care. If they receive harsh treatment from the wearer, like chewing hard foods very often or grinding teeth, they show in breakage or falling off from the mouth.",
    "blog_zircven_longevity_p":"It is a super-strength pressed glass-ceramic material that’s incredibly durable. Traditional porcelain veneers are about as durable as your natural teeth, but e.max® and zirconia veneers are even more durable. When done correctly, e.max® and zirconia veneers should last 10 – 15+ years. Happy Smile Clinics recommend looking after your oral hygiene, limiting sugary foods and beverages, brushing and flossing twice daily, drinking plenty of water and wearing a nightguard splint if you grind your teeth. The longevity of your veneers will depend on how you look after them.",


   "allx_title":"Smile Make Over clinic Pioneers the Future of All-on-X Implant Restorations with Cutting-Edge Revolutionary Technology",
   "allx_page_p":"When all teeth are missing, All-on-X offers a solution that goes beyond expectations. Say goodbye to the challenges of eating, speaking, and smiling; embrace a renewed sense of confidence with the cutting-edge All-on-X Dental Implant Restorations at Smile Make Over Clinic. Our skilled implant specialists collaborate with our dental team to perform accurate extraoral scans, ensuring precise implant positioning without the discomfort of traditional impressions. This leads to better-fitting restorations and significantly reduces treatment times. Patients benefit from a more comfortable experience as the Trios Shape Move 5 system eliminates the need for wide mouth openings typically required for traditional impressions. This technology also reduces chair time, material costs, and the need for try-in appointments, resulting in a near-perfect fit for final restorations and enhanced patient satisfaction. Implant dentistry is rapidly evolving, with All-on-4 &amp; All-on-6 treatments becoming increasingly popular for fully edentulous patients. Ensuring a proper passive fit of the implant-supported prosthesis significantly improves the longevity and success of the implants. Thus, patients receive the most advanced, accurate, and comfortable implant treatment available today, reaffirming our commitment to excellence in dental care.",
   "allx_title1":"What distinguishes All-On-X?",
   "allx_page_p1":"While traditional dentures can be useful, they often lack stability and can be uncomfortable and awkward. The All-on-X implant system uses only four or six implants per arch to securely support a full set of teeth. Some implants are positioned at unique angles to enhance contact and maximize the existing bone’s natural support. Additionally, this method often reduces the need for bone grafting, which is sometimes required with conventional implant procedures. All-on-X denture implants boast a high success rate, comparable to other implant procedures. They offer a cost-effective solution for patients seeking to restore missing teeth.",
   "allx_title2":"How long does the procedure take?",
   "allx_page_p2":"The duration of the procedure varies depending on the patient, but the surgery typically takes approximately two and a half hours per arch. With All-on-X, patients can receive their temporary teeth restoration immediately after surgery. However, there is a 4 to 6-month osseointegration period during which the implants fuse with the jawbone.",
   "allx_title3":"What happens if I don't undergo the All-On-X procedure?",
   "allx_page_p3":"When teeth are lost, progressive bone loss ensues. Without the stimulation provided by roots or implants, the bone rapidly resorbs, with up to 25% lost within the first year. While dentures and crowns may address cosmetic concerns, they fail to tackle bone loss in the jaw, leading to a weakened jawbone over time. This can result in a sunken facial appearance, which is highly unaesthetic. Dental implants stimulate the bone, preventing resorption and preserving facial aesthetics.",
   
   "allx_sidebar_title":"What is the difference between All-On-4 and All-On-6?",
   "allx_sidebar_title1":"How should patients care for their new implant dentures?",
   "allx_sidebar_title2":"Why choose Smile Make Over for All-On-X treatment ?",
   "allx_sidebar_title3":"Will the dental implants require additional adhesives?",
   "allx_sidebar_title4":"",

  

   "blog_allx_all4orall6_post_date":"September XXX",
   "blog_allx_all4orall6_title":"What is the difference between All-On-4 and All-On-6? ",
   "blog_allx_all4orall6_p":"The key difference between All-on-4 and All-on-6 dental implants is the number of implants used. While not necessary for every patient, All-on-6 may be recommended for a more stable and durable foundation for the dental arch. The additional implants help distribute the pressure of chewing and biting more evenly, extending the lifespan of each arch and reducing the risk of further oral health issues. Moreover, these extra implants can enhance jawbone strength and stability, preventing future deterioration.",
   "blog_allx_denture_care_post_date":"September XXX",
   "blog_allx_denture_care_title":"How should patients care for their new implant dentures?",
   "blog_allx_denture_care_p":"Considerable thought and expertise are involved in developing an All-on-X device for a patient. From the strategic placement of the implants to the design of the oral appliance, this restoration facilitates convenient oral hygiene. All-on-X implants function much like natural teeth. However, in addition to regular brushing and dental cleanings, patients should devote extra time to cleaning around the denture base to maintain the dental restoration in optimal condition.",
   "blog_allx_why_smilemakeover_post_date":"September XXX",
   "blog_allx_why_smilemakeover_title":"Why choose Smile Make Over for All-On-X treatment ?",
   "blog_allx_why_smilemakeover_p":"All-on-X, enhanced by iMetric precision, offers a solution that surpasses expectations. Say farewell to the difficulties of eating, speaking, and smiling, and welcome renewed confidence with the advanced All-on-X Dental Implant Restorations at Smile Make Over clinic. Patients benefit from a more comfortable experience as the ICam4D system eliminates the need for wide mouth openings usually required for traditional impressions. This technology also reduces chair time, material costs, and the need for try-in appointments, resulting in nearly perfect final restorations and increased patient satisfaction. With Happy Smile Clinic and the ICam4D system, patients receive the most advanced, accurate, and comfortable implant treatment available today, reaffirming our commitment to excellence in dental care.",
   "blog_allx_adhensives_post_date":"September XXX",
   "blog_allx_adhensives_title":"Will the dental implants require additional adhesives?",
   "blog_allx_adhensives_p":"One of the significant advantages of this procedure is that adhesives are entirely unnecessary. The prosthetic teeth are securely fitted over the implants, ensuring stability. Once fixed, these teeth are permanently in place and cannot be removed by the patient. Should it become necessary to remove the implant-supported dentures, this will be carried out by a dental professional.",

 
    "full_mouth_rehab_title":"Full Mouth Rehabilitation",
    "full_mouth_rehab_p":"A full mouth rehabilitation refers to a combination of different dental treatments and procedures conducted over time to correct a wide variety of dental issues and rebuild healthy smiles. Defined as a restorative approach, a full mouth rehabilitation does not only intend to bring back smiles, but it also aims to improve function while strengthening oral health and tooth structure covering both upper and lower teeth. The customized treatments required for a full mouth rehabilitation are hinged upon an individual’s dental problems, ranging from mild to serious issues. Since a full mouth rehabilitation renews both appearance and function of teeth and gums, it allows the patients to smile more comfortably with enhanced confidence.",
    
    "full_mouth_rehab_page_indication_title":"Indications for Full Mouth Rehabilitation:",
    "full_mouth_rehab_page_indication_1":"Certain dental conditions which are untreated or treated improperly.",
    "full_mouth_rehab_page_indication_2":"Congenital abnormalities affecting enamel formation.",
    "full_mouth_rehab_page_indication_3":"Excessive tooth wear, prolonged tooth abrasion or tooth erosion when the teeth start to lose enamel.",
    "full_mouth_rehab_page_indication_4":"Extended poor dental hygiene presenting with multiple afflicted teeth.",
    "full_mouth_rehab_page_indication_5":"Teeth grinding at night (sleep bruxism) causing pain or discomfort in the mouth, jaw and facial muscle.",
   
    "full_mouth_rehab_advantages_title":"Advantages of full mouth rehabilitation in our clinic:",
    "full_mouth_rehab_advantages_p":"Full mouth rehabilitation presents a holistic approach to dental care, offering a myriad of advantages for individuals seeking comprehensive solutions. This comprehensive treatment addresses various dental issues simultaneously, ranging from pain relief associated with tooth decay or gum disease to the enhancement of essential functions like chewing and cutting. Beyond functionality, it places a strong emphasis on aesthetic improvement, boosting confidence through a visually appealing smile. Full mouth rehabilitation is not just about immediate relief; it aims to prevent further damage, providing long-term durability with personalized, custom-tailored treatment plans. By promoting functional harmony between teeth, jaw joints, and facial muscles, it contributes to an improved quality of life. Ultimately, full mouth rehabilitation goes beyond cosmetic enhancements, offering a thorough and encompassing solution to diverse dental problems.",
   
    "full_mouth_rehab_page_stages_title":"Stages of Full Mouth Rehabilitation in our clinic:",
    "full_mouth_rehab_page_stages_examination_bold":"Comprehensive Examination and Diagnosis:",
    "full_mouth_rehab_page_stages_examination":"Thorough examination of oral health, digital imaging, X-rays, and scan impressions to assess the extent of damage and plan treatment.",
    "full_mouth_rehab_page_stages_examination1":"Digital imaging, X-rays, and impressions to assess the extent of damage and plan treatment.",
    "full_mouth_rehab_page_stages_treatment_bold":"Treatment Planning:",
    "full_mouth_rehab_page_stages_treatment":"Development of a personalized treatment plan addressing identified issues and patient goals.",
    "full_mouth_rehab_page_stages_disease_bold":"Initial Phase – Disease Control:",
    "full_mouth_rehab_page_stages_disease":"Management of existing dental issues to establish a healthy foundation.",
    "full_mouth_rehab_page_stages_restorative_bold":"Restorative Procedures:",
    "full_mouth_rehab_page_stages_restorative":"Implementation of necessary restorations, such as fillings, crowns, bridges, or dental implants, to repair damaged teeth.",
    "full_mouth_rehab_page_stages_restorative1":"Replacement of missing teeth to restore functionality and aesthetics.",
    "full_mouth_rehab_page_stages_orthodontic_bold":"Orthodontic Considerations:",
    "full_mouth_rehab_page_stages_orthodontic":"In some cases, orthodontic treatment may be incorporated to correct bite issues and ensure proper alignment of the teeth.",
    "full_mouth_rehab_page_stages_temporomandibular_bold":"Temporomandibular Joint (TMJ) Evaluation:",
    "full_mouth_rehab_page_stages_temporomandibular":"Assessment of the temporomandibular joint's health and function to improve jaw joint and muscle function.",
    "full_mouth_rehab_page_stages_cosmetic_bold":"Cosmetic Enhancements:",
    "full_mouth_rehab_page_stages_cosmetic":"Integration of cosmetic dentistry procedures, such as teeth whitening, veneers, or bonding, to enhance the smile's esthetics.",
    "full_mouth_rehab_page_stages_restorations_bold":"Provisional Restorations:",
    "full_mouth_rehab_page_stages_restorations":"Placement of temporary restorations to ensure functionality and protection while final restorations are being fabricated.",
    "full_mouth_rehab_page_stages_finalization_bold":"Finalization and Adjustment:",
    "full_mouth_rehab_page_stages_finalization":"Delivery of final restorations (veneers, crowns, prosthetic on implants), ensuring proper fit, comfort, and functionality.",
    "full_mouth_rehab_page_stages_finalization1":"Fine-tuning of occlusion (bite) to optimize function and prevent future issues.",
    "full_mouth_rehab_page_stages_maintenance_bold":"Follow-up and Maintenance:",
    "full_mouth_rehab_page_stages_maintenance":"Post-treatment follow-up appointments to monitor healing and address any concerns.",
    "full_mouth_rehab_page_stages_maintenance1":"Maintenance plan, including regular dental check-ups and cleanings, to preserve the results of full mouth rehabilitation.",
    
    
    
    "zirconia_crowns_title":"What is the restoration called a Dental Crown?",
    "zirconia_crowns_p":"It`s hard to feel attractive when facing problems with our smile. The damaged, decayed or missing teeth usually reduce our confidence. Modern dentistry is fortunately in position to restore our smile with dental crowns and other prosthetic restorations.",
    "zirconia_crowns_p1":"When a large amount of tooth substance is lost due to decay or injury, a dental crown is usually the best choice. To enable the placement of the dental crown, the dentist prepares the tooth, in order to use the healthy remaining substance. The crown covers all of the visible parts of the prepared tooth and restores its size and morphology.Crowns modify and restore damaged teeth, allowing the correct functioning and aesthetic simulation with natural dentition.",
    "zirconia_crowns_appointment_title":"How many appointments are needed?",
    "zirconia_crowns_appointment_p":"The stages of placing a dental crown are:",
    "zirconia_crowns_appointment_li1":"Removal of carious tooth substance.",
    "zirconia_crowns_appointment_li2":"Preparation of the tooth to give the appropriate shape and morphology.",
    "zirconia_crowns_appointment_li3":"Impression of the dentition, so that the dental lab dental fabricates the customized dental crown accordingly.",
    
    "zirconia_crowns_appointment_li4":"Your tooth will receive a new temporary crown that protects it until the final restoration is ready to be permanently placed on.",
    "zirconia_crowns_appointment_li5":"The temporary crown is removed and the final dental crown is bonded to the prepared tooth, if it fulfils the biological and cosmetic expectations.",
    "zirconia_crowns_appointment_li6":"Bonding of the final restoration.",
    

    "zirconia_bridges_title":"What is the restoration called a <<Βridge>>",
    "zirconia_bridges_p":"Whenever the longevity of a tooth restoration it is not possible, we replace it with an implant or we place a bridge.Bridges are commonly used to replace one or more missing teeth. They span the space where the teeth are missing. Bridges are cemented to the natural teeth or implants surrounding the space of the lost teeth. The “abutments” teeth, i.e. the prepared teeth, serve as anchors for the bridge, while the “pontics”, i.e. the lost teeth, are attached to the dental crowns that cover the abutments.",
    "zirconia_bridges_p1":"Your dentist can help you choose the type of bridge is best for you, based on the location of the missing teeth, their function, aesthetic considerations and cost. Any prosthetic restoration should be incorporated into the natural dentition and make us feel comfortable. It requires the same care as the natural teeth. Daily brushing, according to the doctor&#8217;s instructions, reduces plaque development helping the longevity of a bright smile.",
  

    "whitening_service_page_title":"Teeth Whitening",
    "whitening_service_page_p":"A bright smile is always attractive to...",
    "whitening_page_title":"Teeth Whitening",
    "whitening_page_p":"A bright smile is always attractive to those around us and strengthens our confidence. Often, though, our teeth are not as white as we would like them to be. Certain foods and drinks daily consumed and tobacco products may discolor them. Even the natural shade of teeth wears off over the years, negatively affecting their color. Our dentition discoloring is inevitable, but that does not mean we need to accept it.",
    "whitening_page_p1":"Tooth whitening is a relatively inexpensive way to erase the time marks out from our smile. You have definitely heard about various products or toothpastes that promise whiter teeth, however, they are minimally effective and often highly damaging for the dental enamel.",
    "whitening_page_what_title":"What is teeth whitening?",
    "whitening_page_what_p":"The only safe and guaranteed method results is the application of specific medical formulations by the dentist. Within a session your teeth can become two to six tons whiter. Following a certain protocol procedure, the dentist initially protects the gums and exposed roots with a specific agent applied to avoid contact with the bleaching agent. The activity of the latter is usually enhanced through exposure to a special light source. The protocol of “home bleaching procedure” contains the use of bleaching agent of light concentration, applied in personalized splints, according to the instructions of the dentist. It is usually recommended in combination with the clinical session for maximum results, which are visible immediately after the completion of the treatment.",
    "whitening_page_safe_title":"Is bleaching safe for my teeth?",
    "whitening_page_safe_p":"As any other treatment, teeth whitening should be personalized. After clinical examination the dentist will propose the appropriate treatment for you and inform you about any side effects, such as tooth sensitivity or gum irritation, which may take place. The crowns and fillings color you may already have is not affected. The result of whitening is not permanent, but weakened by time, depending mostly on the oral hygiene, eating habits, smoking, etc and affect the periods of recall treatments.",

    "hollywood_smile_page_what_title":"What Is Hollywood Smile? ",
    "hollywood_smile_page_what_p":"Hollywood smile is a smile aesthetic treatment applied to people who want to have a remarkable smile. It is a treatment that can be applied to everyone, regardless of woman or man. The process of covering one's own teeth with porcelain veneer in order to have a more aesthetic and beautiful appearance is called Hollywood smile. Inspired by Hollywood celebrities, this type of treatment is based on dental aesthetics. ",
    "hollywood_smile_page_what_p1":"Today, in addition to foreign celebrities, there are many celebrities who have Hollywood smiles in our country. The number of people who apply to the porcelain tooth veneer method is increasing day by day due to concerns such as aesthetic appeal, removal of dental defects, and respect in front of the society. Normally, our tooth color is bone-colored, but nowadays, because the white tooth has become a symbol of prestige, it is a frequently preferred method to lighten this bone color or have a coating on it.",
    "hollywood_smile_page_purpose_title":"What Are the Purposes of the Hollywood Smile?",
    "hollywood_smile_page_purpose_p":"The aims of the Hollywood smile are as follows:",
    "hollywood_smile_page_purpose_li_1":"Achieving an aesthetically pleasing appearance",
    "hollywood_smile_page_purpose_li_2":"To provide a symmetrical smile",
    "hollywood_smile_page_purpose_li_3":"To eliminate the insecurity caused by bad-looking tooth structure",
    "hollywood_smile_page_purpose_li_4":"Making you truly feel like a star with a Hollywood smile",
    "hollywood_smile_page_purpose_li_5":"Creating an ideal smile for the face",
    "hollywood_smile_page_longevity_title":"How Long Does a Hollywood Smile Last?",
    "hollywood_smile_page_longevity_p":"If you choose to undergo a Hollywood smile procedure, you won’t be disappointed. Results appear instantly and naturally, and you'll see a significant improvement in many facets of your smile, from the way they are positioned to their pearly sheen and ideal measurements. This long-lasting smile can stay with you for at least 15 years. How long your Hollywood smile lasts depends on the durability of any veneers, crowns, or dental implants you have placed on your teeth and on maintaining a proper dental care routine.",
    "hollywood_smile_page_stages_title":"What is the Hollywood Smile Procedure?",
    "hollywood_smile_page_stages_p":"The full procedure to get the greatest Hollywood Smile Makeover often requires a week’s worth of 2-3 dentist visits.",
    "hollywood_smile_page_stages_evaluation_bold":"Smile Evaluation:",
    "hollywood_smile_page_stages_evaluation":"The cosmetic dentists will evaluate your teeth during your consultation to determine which type of veneers is the best option for you. You will also talk about your ideal new teeth’s shape, length, width, and color during this consultation. In order to create temporary veneers and a digital smile design preview of your new Hollywood smile makeover for the second session, your dentist might take pictures of your mouth. This preview gives you an idea of how your face will look like, allowing you a chance to make an informed decision before you commit to the Hollywood Smile procedure.",
    "hollywood_smile_page_stages_preview_bold":"Preview:",
    "hollywood_smile_page_stages_preview":"A set of temporary veneers based on the specifications from the initial consultation are created to ensure that you are comfortable and would like to move through with the design. In order to make room for the temporary veneers, your cosmetic dentist needs to remove a very thin layer (less than half a millimeter) of the enamel from your teeth. A fresh mold of your teeth is obtained after the removal procedure. This mold is used to create the permanent veneers.",
    "hollywood_smile_page_stages_permanent_veneers_bold":"Permanent Veneers:",
    "hollywood_smile_page_stages_permanent_veneers":"This last visit to your cosmetic dentists in the Hollywood smile procedure is to install the permanent veneers. The veneers may need to be adjusted or cut to guarantee a perfect fit on your teeth. Also, the success and life of the dental veneers depends on how they have been prepared and what materials have been used in the preparation process. Your teeth will be cleaned, polished, and etched once your veneers have been fitted correctly. Each veneer is coated with a premium dental cement before being attached to your teeth. Once each veneer is in place, the cosmetic dentist will solidify the dental cement using a special light. Your bite will be examined after all of your veneers have been positioned.",
    "hollywood_smile_page_stages_smile_bold":"Smile:",
    "hollywood_smile_page_stages_smile":"Now is the time to boast your beautiful smile!",
    "hollywood_smile_page_stages_p1":"Hollywood smile can be made to anyone who meets certain conditions, regardless of gender. The best thing you can do to find out if you are a suitable candidate for that treatment is to visit your dentist. Your dentist will inform you in detail about whether this treatment is suitable for you, what kind of process awaits you and what kind of smile you will have as a result.",

    "veneers_page_what_title":"What are dental veneers?",
    "veneers_page_what_p":"Porcelain veneers provide an effective solution to problems such as fractures or deformations on tooth surfaces. Porcelains, which offer a similar texture and color with natural teeth, are integrated into the front surfaces of the teeth. These porcelains, which are in perfect harmony with other teeth, also carry the sensitivity to ideal levels. Although it exhibits a semi-permeable and thin appearance, the leaf teeth are as durable as possible.",
    "veneers_page_what_p1":"Laminated porcelain, which minimizes the loss of healthy tooth tissue in different applications, is also in a unique position in this regard. During the application, minor abrasions ranging from 0.3 millimeters to 0.5 millimeters are made on the tooth surfaces. This ensures that healthy tooth tissue is not lost.",
    "veneers_page_what_p2":"Conditions such as fracture or deformation due to trauma affect dental health negatively. In addition, decays may occur if care is not ignored. Developed to prevent negative situations on the tooth such as breakage or deformation and not to ignore aesthetic concerns while avoiding these, leaf tooth coating also gives perfect results in terms of harmony and sensitivity.",
    "veneers_page_what_p3":"Among the most successful applications in the aesthetic framework among dental treatments, leaf tooth veneer is considered as important as health as well as appearance. After the treatment, the closest tissue to the natural tooth is obtained, and all patients who prefer leaf porcelain have healthy, white smiles.",
    "veneers_page_advantages_title":"What are the advantages of dental veneers?",
    "veneers_page_advantages_li_1":"Veneers can dramatically enhance the appearance of your smile.",
    "veneers_page_advantages_li_2":"Veneers can dramatically enhance the appearance of your smile.",
    "veneers_page_advantages_li_3":"Veneers resist staining better than your natural tooth enamel.",
    "veneers_page_advantages_li_4":"Dental veneers don’t require any additional maintenance.",
    "veneers_page_advantages_li_5":"They have a lifespan of 10 to 15 years with proper care.",
    "veneers_page_before_title":"What happens before dental veneer placement?",
    "veneers_page_before_p":"During your initial appointment, your dentist will examine your teeth and gums to determine if you’re eligible for veneers. If you’re a candidate, they’ll prepare your teeth by removing small amounts of enamel. Next, they’ll take impressions of your teeth. A dental lab technician will use these impressions to make your custom veneers. (If you choose composite veneers, dental impressions aren’t needed.)",
    "veneers_page_before_p1":"It can take a few weeks for the dental lab to complete your veneers. If necessary, your dentist can place temporary veneers in the meantime. Once the technician finishes your veneers, the lab will ship them to your dentist’s office.",
    "veneers_page_placement_title":"What happens during veneer placement?",
    "veneers_page_placement_p":"During a second office visit, your dentist will check the shape, color and fit of your veneers, then permanently bond them into place using dental cement. Finally, they’ll check your bite and make any necessary adjustments.",
    "veneers_page_placement_p1":"If you want to change something about your veneers, like the shape or color, let your dentist know. They’ll work with you and the dental laboratory to ensure that your results are satisfactory.",
    "veneers_page_placement_p2":"There’s no downtime following veneer placement. People who receive dental veneers can return to normal activities the same day. You can also eat or drink immediately after your appointment, as long as the anesthesia has worn off.",
    "veneers_page_cost_title":"How much do veneers cost?",
    "veneers_page_cost_p":"Veneers aren’t often covered by insurance because they’re considered a cosmetic procedure. In general, you can expect to pay between $925 and $2,500 per tooth, according to the American Dental Association.",
    "veneers_page_cost_p1":"Composite veneers cost around $400 to $2,000 per tooth and last between 5 to 7 years. In the long term, traditional veneers are often the most cost-effective option.The cost of your veneers depends on factors like what type of veneers you’re choosing, what brand name your dentist has available, your area’s cost of living, and the dentist’s expertise. It can cost significantly less if you visit a clinic with dentistry students who are supervised by dentists on the dental school faculty.",

    
    "veneers_resin_dentalServices_title":"Composite Resins’ Bonding",
    "veneers_resin_dentalServices_p":"",
    "veneers_resin_page_general_title":"COMPOSITE RESINS’ BONDING",
    "veneers_resin_page_when_title":"When should be an option?",
    "veneers_resin_page_when_p":"Is there a micro fracture in your tooth or some disharmony in color and size of your dentition? One of the most important developments in dentistry took place in the area of bonding. This evolution led to the production of biomaterials that made possible the effective correction of aesthetic problems in the mouth. In this case, the restorative material is the composite resin which is available in a variety of colors to match your natural dentition.",
    "veneers_resin_page_when_p1":"Compared with other restorations is the less expensive. The procedure is simple and minimally invasive for your natural teeth.",
    "veneers_resin_page_procedure_title":"What is the process?",
    "veneers_resin_page_procedure_p":"Initially the dentist etches the tooth’s surface and applies the appropriate adhesive material. Then the composite resin is placed and cured with ultraviolet light. The final shape is rendered with special cutting and grinding tools. Usually the process is completed in one session. The CR restoration can be a permanent smile recovery solution or can be used as a temporary restoration until another scheduled final work is ready to be put on. It is considered to be ideal for children after injury, which is a common phenomenon.",
    "veneers_resin_page_longevity_title":"How long do they last?",
    "veneers_resin_page_longevity_p":"The main disadvantage of these restorations is that they absorb pigments, like natural teeth do. Drinking coffee, red wine and smoking aggravate discoloration. Adhesive ability of materials decreases when under excessive force, such as nail biting and clenching of teeth. Your dentist can help you decide if the CR restoration is suitable for you.",
  
    

    
    "veneers_porcelain_dentalServices_title":"All - Ceramic Veneers",
    "veneers_porcelain_dentalServices_p":"",
    "veneers_porcelain_page_what_title":"ALL - CERAMIC VENEERS",
    "veneers_porcelain_page_what_p":"80% of people are unhappy with their smile. In many of these cases veneers can provide the solution. Unlike a crown, a ceramic veneer is a thin -layer porcelain cover bonded on the tooth surface. In fact, veneers’ offering to your smile is the same as the renewal of the wall colors’ offering to your home. A simple wall painting over the colors faded by time brings a great change. The same applies your smile with a minimum renewal of tooth surface.",
    "veneers_porcelain_page_achieve_title":"How is this achieved?",
    "veneers_porcelain_page_achieve_p":"Your dentist can provide you with all the necessary information to decide whether veneers are right for you. This includes a discussion about what your likes and dislikes in your smile, as well as the final result you dream to achieve.",
    "veneers_porcelain_page_achieve_p1":"Veneers address to many cosmetic problems, such as the improvement of the size, shape and color of your teeth. They give us the potential to either lengthen or shorten the teeth, even close undesirable spaces between them, requiring only a minimum of material thickness.",
    "veneers_porcelain_page_ways_title":"What is the preparation that my teeth should undergo?",
    "veneers_porcelain_page_ways_p":"There are two types of all-ceramic veneers:",
    "veneers_porcelain_page_ways_li_1":"Conventional",
    "veneers_porcelain_page_ways_li_2":"Non-Conventional",
    "veneers_porcelain_page_ways_p1":"Conventional veneers are the most popular ones. The dentist creates the minimum space necessary for the ceramic material bonding on the tooth surface, by removing a slight amount of enamel. Unconventional veneers do not require the removal of tooth substance at all. They are of minimal thickness, and are bonded on the existing enamel surface. However, this technique has its own limitations. The dentist will help you decide which type of procedure is suitable for you.",
    "veneers_porcelain_page_compatibility_title":"Is this the right treatment plan for me?",
    "veneers_porcelain_page_compatibility_p":"Orthodontic treatment or teeth bleaching are alternative techniques resulting in a beautiful smile either alone or in combination, in order enhance the final result. There are also techniques that enable your doctor to visualize for you the result, when discussing the smile you dream of. The time spending on dental chair may be limited to two sessions. Following the agreement of the treatment plan, your dentist will cooperate with qualified dental technicians, so that ceramic veneers will not stand out from your teeth, while the result will be surprising!",
    "veneers_porcelain_page_longevity_title":"How long will they last?",
    "veneers_porcelain_page_longevity_p":"Although ceramic veneers are highly resistant they are not indestructible. It is advisable to avoid hard and sticky foods over them. In case of bruxism, using a protective splint will protect your new smile. With proper care, veneers will remain intact for a long time of period",
   

    "touth_implant":"Implants",
    "touth_implant_service_p":"Experience a long-lasting solution for missing teeth with dental implants. Our precise, expert care ensures secure, natural-feeling implants that restore both your smile and confidence.",
    "touth_implant_page_title":"Dental Implants",
    "touth_implant_page_p":"Dental implants are the most effective solution for replacing missing teeth. We offer the latest technology and expertise to restore your smile, dental functionality and confidence. By combining scientific expertise with artistic precision, we achieve uniquely refined, perfectly designed &amp; healthy results.",
    "touth_implant_page_smile_refresh_title":"Refresh your Smile with dental implants",
    "touth_implant_page_smile_refresh_p":"No one likes the idea of an incomplete smile. In the past, the only solutions for tooth loss were dental bridges or traditional dentures: artificial teeth that were either anchored to other teeth in your mouth or to your gums. Modern dentistry offers a better solution to tooth loss: dental implants. Whether you get one, a few or a full arch of implants (All-on-4 &amp; 6), the result is a proper replacement for your teeth, allowing you to eat, smile and speak naturally. The stabilization provided by implants restores speech and allows proper chewing, contributing to overall oral function. In addition, implants provide stability to the gum and jaw structures, greatly enhancing your natural beauty. Our professional implant team is highly experienced and works closely with the clinic’s master ceramist in the design to create a natural or dramatic result. Dental implants are a durable, long-term alternative to removable dentures, whether partial or complete. Providing exceptional support and stability for dental crowns is the superior choice for patients in such situations. Think of dental implants as more than a treatment; they are a transformative experience. By putting your favorite foods back on the menu and restoring a confident smile to your face, implants have the power to provide a profound boost to your day-to-day wellbeing.",
    "touth_implant_page_success_rate_title":"What is the success rate of dental implants?",
    "touth_implant_page_success_rate_p":"Dental implants have achieved a consistently high success rate (over 95%) since their introduction decades ago. Greater success is achieved through a combination of surgical technology, high-quality materials, clinical experience, and long-term maintenance. Naturally, when you undergo any restorative health care treatment, you want to be confident that you’ll receive the absolute best care, both in terms of the skill and capability of the provider and in the quality and effectiveness of the materials used in the procedure. At Smile Make Over clinic, we are committed to giving our patients the best possible result in everything we do, which means using the finest dental implants available. Therefore, we choose to use Nobel BioCare implants in our clinics, as they feature the most effective designs and highest quality materials available today with a lifetime guarantee. For dental implants to provide the most excellent combination of longevity, stability, durability, and appearance, they must be manufactured with the highest quality materials. Titanium is the finest dental implant material due to its unique combination of strength, lightweight, and ability to strongly bond with human bone. This last factor is significant, as not all metals can do this.",

    "implant_sidebar_title_lose_teeth":"Why do we lose our teeth ?",
    "implant_sidebar_title_gold_standard":"What makes dental implants 'The Gold Standard' ?",
    "implant_sidebar_title_quality_implant":"What is the quality of Dental Implants ?",
    "implant_sidebar_title_eat_anything":"Can I eat anything with Dental Implants ?",
    "implant_sidebar_title_additional_procedure":"Are there ant additional procedures needed ?",
    "implant_sidebar_title_is_painful":"Is it painful to get Dental Implants ?",
    
    "blog_implants_lose_teeth_p":"People lose their permanent teeth for many reasons, including accidents, trauma, and disease. One of the most common diseases that can result in the loss of permanent teeth is periodontitis, also known as gum disease. This disease occurs due to bacteria and infection in the gums and leads to inflammation and the bone and tissue supporting the teeth breaking down. Pregnancy, osteoporosis, and even some medications can also cause tooth loss. Many adults experience teeth loss, so you’re not alone. Dental implants offer the most incredible comfort of all tooth replacement solutions and avoid the long-term health effects of tooth loss and bone density reduction. Choosing to undergo a dental implant procedure is a big step, but one that can have a significant impact on the state of your health & quality of your life. Therefore, it’s so important that the procedure is performed with only the best tools, equipment, and materials. Losing teeth can occur for a wide range of different reasons. Perhaps the tooth was knocked out by an accidental impact or became so severely damaged as to necessitate an extraction, or maybe extensive tooth decay and other dental problems have caused one or more teeth to become loose or even fall out. Regardless of the underlying cause, lost teeth can lead to further oral health problems if left untreated. Fortunately, dental implants are a simple, effective, and permanent solution to the problem of lost and missing teeth. Dental implants are far superior to other options, such as traditional dentures or bridges. They can prevent many of the long-term dental problems known to develop because of the loss of teeth in the jaw, including gradual bone density loss and problems chewing or talking.",
    "blog_implants_gold_standard_p":"Dental implants are the only permanent tooth replacement option, and they’re designed to last for decades. Because they are surgically inserted into the jawbone, they provide health and functional benefits comparable to natural teeth. Since the implant itself mimics the form and structure of a natural tooth and is embedded directly into the jaw to take the place of the entire missing tooth and root, it prevents the loss of bone density.",
    "blog_implants_quality_implant_p":"The shape and structure of the post of the implant also have a significant impact on the connection between the bone and the replacement tooth. Many types of implants have specialised ‘threads’ on the post designed to provide the maximum surface area for the bone to adhere to, increasing the connection’s strength and the bond’s permanence. While there are many different manufacturers of dental implants, Happy Smile Clinic relies on the quality and advanced technology of the dental implants offered by Nobel BioCare, Straumann, and Hiossen. As the industry leader in dental implant innovation, both in design and material development, Nobel BioCare, Straumann, and Hiossen have a proven track record that is renowned worldwide. Happy Smile Clinics feels there is no better choice of dental implants for our patients than Nobel BioCare, Straumann, and Hiossen.",
    "blog_implants_eat_anything_p":"Yes. Once your implants have completely healed, you can treat them like natural teeth. Many patients report being able to eat foods that they couldn’t eat before surgery and can enjoy chewy and hard foods again. Only liquids and soft food are allowed during the healing process to prevent irritating your jaw and gums. This can range anywhere from a few days to a week before you can slowly add solid foods to your diet.",
    "blog_implants_additional_procedure_p":"Not always, but three different procedures can accompany implants. Bone grafting is needed if your jawbone is too thin or soft because chewing puts much pressure on your jawbone, and the implant can fail once you begin to eat solid food. A bone graft will strengthen your jawbone using a part of your bone from a different area of your body or synthetic bone material. A few months will be needed for the graft to grow strong enough to support the implant. A sinus augmentation is sometimes required if an implant is put in the upper jawbone, depending on the location of your sinuses. This procedure lifts the floor of the sinuses to give more room for the implant. Bone augmentation is needed if the patient’s jawbone needs additional work. Bone augmentation is a surgical procedure to replace bone surrounding the root of a tooth, making it possible for you to have an implant if you don’t have enough natural bone in your jaw. Unlike other body tissue types, bone can regenerate in the right conditions. A graft makes this process possible while helping to hold your implant and existing teeth in place. Over time, your bone will grow to replace the graft material. Once the site around the graft has successfully healed and been provided, you don’t need any other supporting treatments; you’ll be ready to have your implant placed. There are many reasons why you may not have enough bone to hold an implant securely in place, but you might need a bone graft if: -Your teeth are loose or unstable, or you suffer from gum disease. Gum disease can break down gum and bone tissue -You had a tooth extracted some time ago. The gap left following extraction can sometimes affect the teeth on either side, and the bone can begin to deteriorate -You’ve had lots of infections in your mouth. This can lead to bone loss over time -You’ve had an injury to your mouth. The impact could have led to bone loss.",
    
    

    "invisible_orthodontics_services_title":"Invisible Orthodontics",
    "invisible_orthodontics_services_p":"",
    "invisible_orthodontics_page_title":"Invisible Orthodontics",
    "invisible_orthodontics_page_p":"In recent years, more and more adults are turning to orthodontists seeking treatment, expressing their desire for aesthetic appearance of orthodontic appliances. Following the initial introduction of clear orthodontic aligners, their application has become widely accepted mainly due to their aesthetics.",
    "invisible_orthodontics_page_p1":"This technique is mainly suitable for adult patients with non-skeletal orthodontic problems, as well as in cases of relapse after orthodontic treatment. Aligners have advantages over orthodontic brackets, mainly in terms of aesthetics, ease of use by the patient, and the ability to maintain better oral hygiene. This system meets the aesthetic demands of patients and can be successfully applied to mild to moderate dental irregularities in adults.",
    "invisible_orthodontics_page_advantages_title":"Advantages of Invisible Orthodontics",
    "invisible_orthodontics_page_advantages_p":"This kind of treatment based on a sequence of transparent braces, which gradually move the teeth to the desired position, in a completely aesthetic way. It uses  the same transparent braces for children and adolescents as for adults, without applying the braces and wires of the classic orthodontic treatment.",
    "invisible_orthodontics_page_advantages_li_1":"Invisible & durable splints ",
    "invisible_orthodontics_page_advantages_li_2":"Reduced treatment time up to 50% compared to conventional braces treatment",
    "invisible_orthodontics_page_advantages_li_3":"Convenient & comfortable  splints that do not hurt or irritate",
    "invisible_orthodontics_page_advantages_li_4":"Awesome aesthetic result since it is transparent and no one will understand that you are in treatment",
    "invisible_orthodontics_page_procedure_title":"How Does Invisalign Work: A Step-by-Step Guide:",
    "invisible_orthodontics_page_procedure_title_p":"With the use of the oral scanner the patient has the opportunity to see the final result of the treatment even from the first appointment. The complete treatment plan is then performed and each movement of the teeth on the computer is determined.It is important for the patient to know that the orthodontist is the one who determines and plans every movement of the teeth and not the computer. Once the treatment plan is approved, the splints are made by XXXXXXXXX laboratory.",

    "denture_all_service_page_title":"Denture",
    "denture_all_service_page_p":"",
    "denture_main_page_title":"I have lost all my teeth! What should I do?",
    "denture_main_page_p":"Total or partial loss of the teeth not only makes us seem aged but also affects speech and mastication. Fortunately, there are now a variety of solutions for the recovery of the oral function.",
    "denture_main_page_p1":"The most inexpensive option are the dentures. Many people use them and do not necessarily distinguish from natural teeth thanks to the skill of experts and the development of modern materials.",
    "denture_main_page_solution_title":"Is the dentures the only solution?",
    "denture_main_page_solution_p":"There are three types of removable restorations:",
    "denture_main_page_solution_li_1":"Full dentures",
    "denture_main_page_solution_li_2":"Over dentures",
    "denture_main_page_solution_li_3":"Partial dentures",
    "denture_main_page_solution_p1":"In case the whole dentition is lost, a full denture is the most inexpensive solution that also supports the face contour that is lost. On the other hand the dentures remain unstable, especially in the lower jaw, where they can easily be displaced anytime by the tongue.",
    "denture_main_page_solution_p2":"If this is the case, over dentures could smooth out the problem, since they are based on natural teeth or implants and provide with the assurance of stability in the oral cavity. Usually two mandible implants are sufficient to hold an over denture, while the maxilla implants should be at least four.",
    "denture_main_page_solution_p3":"Partial dentures can perform stability as well, especially when supported bilaterally by natural teeth. The most common problem the food trapped under them and the long-term caries of the natural supportive teeth.",
    "denture_main_page_eat_title":"Will I be able to chew properly?",
    "denture_main_page_eat_p":"All types of removable restorations are customized in dental laboratories, using the impressions of the patient received by the dentist, following intraoral modifications to restore the function of mastication and speech. If all the teeth must be extracted, an immediate full denture can be used in order to avoid staying edentulous. After the complete healing of tissues the final dentures are placed on. Post-treatment recalls are of vital importance. Removable prosthetic restorations will require modification over time because bone tissue changes take place. The time interval varies from patient to patient. The aim of the dentist is to ensure both proper function and aesthetic satisfaction.",

    "prosthetics_lays_all_service_page_title":"Inlays - Onlays",
    "prosthetics_lays_all_service_page_p":"",
    "prosthetics_lays_main_page_title":"Restorations of Minimal Intervention(Inlays/Onlays)",
    "prosthetics_lays_main_page_p":"Latest science developments have provided dental practice with improved materials allowing the preservation of more tooth substance and the removal of the damaged tissue only.",
    "prosthetics_lays_main_page_what_title":"What are the inlays and onlays?",
    "prosthetics_lays_main_page_what_p":"Inlays and onlays are two types of dental restorations designed to restore large defects that have appeared in the posterior teeth because of caries or fracture. It is the best choice when the extent of the damage does not allow the fitting of a filling. Accordingly, full coverage of the tooth with a dental crown requires further preparation of tooth that is already overworked and in pain.",
    "prosthetics_lays_main_page_procedure_title":"Preparation procedure",
    "prosthetics_lays_main_page_procedure_p":"The dentist is following respectively the same steps with those for the preparation of a dental crown. The impression of patient’s dentition is sent to the dental laboratory for fabricating the restoration either of ceramic material (porcelain) or of composite resin. On the next appointment the inlay/onlay is checked for its integrity, fitting and color matching. Then the restoration is bonded to the tooth under absolute saliva control.",

    "periodology_services_title":"Periodology",
    "periodology_services_p":"It refers to the specialization of dental science that is related. More...",
    "periodology_title":"Periodology",
    "periodology_p1":"It refers to the specialization of dental science associated with addressing the problems of the gums and soft tissues of the oral cavity. According to the Commission of Infections one out of two adults are facing periodontal issues of varying severity.",
    "periodology_p2":"The early stages of gum disease can be easily treated by the dentist. Specialized dentists are capable of curing the advanced periodontal inflammations requiring microsurgical interventions for the regeneration of soft tissues. The use of the laser in these treatments is proved to be of decisive significance.",
    "periodology_p3":"It is important to know that periodontal disease in turn is a risk factor for damaging other organs (e.g. heart), since bacteria and their toxins are transferred throughout the body by blood circulation.",
    "periodology_li_p":"Seek advice of a specialist if you have any of the following problems:",
    "periodology_li_1":"Bleeding while brushing.",
    "periodology_li_2":"Irritated, sensitive and red gums with bleeding tendency.",
    "periodology_li_3":"Gum loss.",
    "periodology_li_4":"Teeth sensitivity or pain when chewing.",
    "periodology_li_5":"Bad breath or bad taste.",
    "periodology_li_6":"Teeth mobility.",

    "orofacial_services_title":"Orofacial Pain",
    "orofacial_services_p":"There are few who suffer from chronic orthodontic pain. More...",
    "orofacial_title":"Disorders of the temporomandibular joint",
    "orofacial_p":"Many people do suffer from chronic orofacial pain, chewing difficulties and decreased function of the mandible. All these conditions are associated with problems in the temporomandibular joint (TMJ).",
    "orofacial_title_what":"What do these disorders concern?",
    "orofacial_title_what_p":"Disorders of TMJ concerns the joint connecting the lower jaw to the rest of the skull. Its morphology is more complicated than any other joint’s in the human body, in order to provide the mandible with a variety of movements serving the functions of mastication.",
    "orofacial_title_symptoms":"What are the symptoms?",
    "orofacial_title_symptoms_p":"TMJ disorders can cause severe pain making chewing and speech very difficult. The mandible can also be locked into a position while the mouth is either open or closed. Diagnosis, however, of the disorder is difficult, since other situations, such as a toothache or sinusitis, may have similar symptoms. In such cases, the advice of a dentist is valuable.",
    "orofacial_title_therapy":"What is the treatment?",
    "orofacial_title_therapy_p":"There are several treatment options depending on the type of the disorder and its severity. It is advisable to adapt a conservative approach at the beginning, i.e. hot or cold compresses, soft diet and physiotherapy exercises. At the next level intraoral splints and / or medication are recommended.",

    "face_improvement_services_title":"Facial Aesthetics",
    "face_improvement_services_p":"Can the dentist help me improve my facial aesthetics?",
    "face_improvement_title":"Can the dentist help me improve my facial aesthetics?",
    "face_improvement_p":"The confidence that comes out from a nice smile as well as the human need to maintain his face unaltered in time, using it as a mirror of the soul, leads the dentist to take a high-standard aesthetic role. This role extends from the oral cavity to the soft tissue of the perioral area and, in some cases, to the wider facial region. Special techniques give us the potential, not only to eliminate the effects of aging in areas such as the lips, the “puppet lines , the nasolabial grooves, etc., but also to achieve the aesthetic beauty, by using them for volume filling or renewal of the face in areas where the patient wishes. These techniques have been studied and applied for years in medicine for healing and restoration. They are painless methods, easy and absolutely safe, in which our office has been specialized.",
    "face_improvement_technic_title":"What are the techniques used?",
    "face_improvement_technic_p":"There are two categories of non-surgical treatments:",
    "face_improvement_technic_li_1":"contemporary biochemistry and nanotechnology have indicated as appropriate (hyalouronic acid treatment, botox therapy -botox therapy, mesotherapy with various molecules)",
    "face_improvement_technic_li_2":"alternative methods dealing with the human body on the whole, that include(aesthetic acupuncture, rejuvance, autologous mesotherapy (PRP))",

    

    "prp_service_title":"Treatment with PRP",
    "prp_service_p":"To learn more about PRP treatment click here!",
    "prp_title":"Treatment with PRP",
    "prp_p1":"This technique is based on the discovery that our cells have the ability to repair themselves, if damaged, when stimulated. A small amount of blood is enough to stimulate our own repair mechanisms. Is there any more safety than using our own cells? The autologous serum is prepared in real time and applied on the skin of the face and neck area, either by injected mesotherapy and the use of local anesthetic cream or by a special micro-needling device without anesthesia. The skin is refreshed from inside out and the filling of wrinkles occurs gradually, while scars (from acme etc) eventually disappear. It is all about a natural lifting which makes the face look more fresh and youthful, without altering its individual characteristics.",
    "prp_p2":"The treatment protocol is completed with the preparation of your personalized serum in our clinic facilities, for you to apply at home. The results can be seen from the first week, while the improvement is maximized in the following month-period.",


    "botox_service_title":"Treatment with Hyaluronic acid etc",
    "botox_service_p":"To learn more about Hyaluronic Acid, Vitamins and Botox treatments click here!",
    "botox_title":"Treatment with Hyaluronic acid, Botox and Vitamins",
    "botox_p1":"Hyaluronic acid is a natural human skin substance. When injected, it retains water molecules and supports better connection of collagen and elastin fibers. Hyalouronic acid fills permanent skin folds or some areas that need volume increase (i.e. lips), with different techniques depending on the defective area. The material has the texture of a pliable and soft gel which flows easily under the skin, while it contains a substance with local anesthetic activity as well.",
    "botox_p2":"The process is simple and immediately after the treatment the patient can fully return to its activities. Small irritation may appear in the area of application but it usually disappears within 24 hours. Serious side effects are not present. Nevertheless it is significant that the medical history of the patient has been previously discussed with the doctor, so that any situation that is contraindicated (e.g diabetes) has been excluded.",
    "botox_p3":"Treatment with hyaluronic acid is often used along with vitamin complexes as a mesotherapy treatment for face and neck hydration.",
    "botox_p4":"Botox derives from a bacterium called Clostridium botulinum. When used correctly and in small doses, it has a number of theurapeutical and cosmetic uses. Reducing the appearance of facial wrinkles is its primary use.",
    "botox_p5":"Its effect lasts 3-12 months, depending mostly on the treatment area. People generally tolerate Botox treatment well and side effects (such as headache, mild pain or bruising) are not common.",
    "botox_p6":"New trend in Hollywood is called <strong>baby botox</strong> and leads to shiny skin without wrinkles but –most importantly- without the usual “frozen” look of the face.",
    "botox_p7":"The specific treatment appeared first in USA, where plastic surgery had to meet the desire of the film directors for natural face expressions and the need of the actors for youthful beauty.",

    "alternative_therapies_service_title":"Alternative Therapies",
    "alternative_therapies_service_p":"",
    "alternative_therapies_title":"Aesthetic Acupuncture",
    "alternative_therapies_p":"Extremely thin needles are strategically placed in several points on the face in order to activate the elastin and collagen production. This procedure leads to a kind of natural “face lifting”. Blood streaming becomes more intense resulting in huge oxygene amounts reaching the skin surface and thus correction of its defects (eyebags, wrinkles, loosening, discolouration). At the same time “side effects” of stress-release such as better sleeping, digestion and decrease of menopause symptoms are expected.",
    "alternative_therapies_rejuvance_title":"Rejuvance",
    "alternative_therapies_rejuvance_p":"This bioenergetic lifting was used firstly by actors as a relaxing method. Its impressive results though was the reason rejuvance is now included in our armamentarium for natural reconstruction of the face and neck. Muscles gradually gain elasticity and stimulation, skin is hydrated internally, wrinkles are softened and our face seems refreshed and vigorous.",

    "gallery_page":"Page",
    "gallery_from":"from",

    "gallery_span":"Our Recent Dental Achievements",
    "gallery_h2":"Transformative Smiles: Our Before & After Cases",
    "gallery_p":"Unveiling Radiant Smiles: Explore Our Before & After Gallery. Experience the Transformative Power of Our Dental Expertise, Restoring Confidence and Radiance, One Smile at a Time.",
    "gallery_button_previous":"Previous",
    "gallery_button_next":"Next",
    "gallery_button_all_photos":"All Photos",
    "gallery_allx":"All on X",
   
    "gallery_implants":"Dental Implants",
    "gallery_rehab":"Full Mouth Rehabilitation",
    "gallery_zcrowns":"Zirconia Crowns",
    "gallery_zbridges":"Zirconia Bridges",
    "gallery_veneers":"Dental Veneers",
    "gallery_hsmile":"Hollywood Smile",
    "gallery_whitening":"Teeth Whitening",

    "contact_title":"Need dental advice? We’re here to help! Message us anytime for expert care and personalized support!",
    "contact_p":"We stand ready to assist you with all your dental inquiries and requirements. Whether you are seeking advice, wish to schedule an appointment, or have concerns to address, please do not hesitate to send us a message. Our dedicated team is committed to providing the support and solutions necessary for nurturing a healthier smile.",
    "contact_reachout":"Reach out to us via phone or email for assistance.",
    "contact_or":"OR",

    "prices_span":"Prices",
    "prices_h2":"Our Price Packages",
    "prices_all6":"All on 6",
    "prices_all4":"All on 4",
    "prices_implants":"Dental Implants",
    "prices_rehab":"Full Mouth Rehabilitation",
    "prices_zcrowns":"Zirconia Crowns",
    "prices_zbridges":"Zirconia Bridges",
    "prices_veneers":"Dental Veneers",
    "prices_hsmile":"Hollywood Smile",
    "prices_whitening":"Teeth Whitening",
    "prices_packages_basic":"Basic",
    "prices_packages_standard":"Standard",
    "prices_packages_premium":"Premium",
    "prices_packages_gold":"Gold",

    "our_clinic_equipment_h2":"Welcome to Smile Make Over!",
    "our_clinic_equipment_p":"Smile Make Over clinic is dedicated to provide unparalleled dental care, emphasizing continuous innovation and investment in cutting-edge technologies.",
   "our_clinic_equipment_title":"Our Equipment",
    "our_clinic_equipment_product1_h3":"Dental Microscope",
    "our_clinic_equipment_product1_p":"Through the dental microscope we have the ability to identify any dental problem at an early stage. This has the result that we are led to minimally invasive treatment methods, while through the detail and precision that the microscope image ensures us, we remove minimal dental substance, keeping the tooth as strong as possible.",
    "our_clinic_equipment_product2_h3":"Dental Scanner",
    "our_clinic_equipment_product2_p":"Τhe Digital Intraoral Scanner (dental scanner) is our best investment in our clinic. It is the new way of taking impressions of each patient's teeth, without using plasticine-like materials that often cause discomfort to the patient. In this way, the transfer of data to the dental technician is done faster, with absolute precision and completely painlessly, in order to manufacture works such as cases, veneers, bridges, orthodontic splints, etc.",
    "our_clinic_equipment_product3_h3":"Computer Guided Implantology",
    "our_clinic_equipment_product3_p":"With the help of special software, it is designed on the computer and the most suitable position for placing the implants is selected from the beginning. Then, a special surgical splint is made, which is used during the surgery and allows us to place the implants quickly, with high precision, absolute safety and comfort for the patient.",
    "our_clinic_equipment_product4_h3":"Piezotome",
    "our_clinic_equipment_product4_p":"Piezo bone surgery is an alternative method of jaw bone surgery, which is performed using a special device, the piezotome. It is an ultrasound device that gives the dentist the ability to perform high-precision osteotomies. The main advantage of the piezotome is that it does not cut soft tissues but only the bone which is of interest to us. Thus we can perform difficult surgical operations near complex anatomical areas such as large vessels and nerves, protecting them from injury and providing the patient with safety during the operation.",
    "our_clinic_equipment_product5_h3":"CBCT-Panoramic",  
    "our_clinic_equipment_product5_p":"Panoramic X-Rays and Dental cone beam computed tomography (CBCT) are special types of x-ray equipment. Ours is a state-of-the-art scanning machine. We use it to produce precise, high quality 2D and 3D images of your teeth, soft tissues, nerve pathways and bone in a single scan. Unlike standard x-rays, it allows us to measure the bone depth, width, density and condition of your jawbone when necessary and the location of important structures such as nerve and blood canals or the sinuses ingreat detail. We use 2D and 3D images either as a preventive screening or as a partof the treatment planning .",
   

    "dental_tourism_span":"Dental Tourism",
    "dental_tourism_main_h3":"Discover the Enriching Dental Journey in Kalamata: A Blend of Care and Culture",
    "dental_tourism_main_p":"Embarking on a dental journey to Kalamata isn't just about dental care; it's an immersive experience that seamlessly combines expert healthcare with breathtaking surroundings, rich culture, and a rejuvenating lifestyle. Our clinic in Kalamata boasts state-of-the-art facilities and a team of internationally trained dental professionals, ensuring top-notch care for all your needs. What's more, Greece is renowned for offering high-quality healthcare at a fraction of the cost compared to many other countries, making Kalamata a cost-effective option without compromising on quality. As you undergo treatment, you'll find yourself surrounded by the stunning scenery of the Mediterranean Sea, the Taygetos mountains, and the prestigious Costa Navarino, providing a tranquil backdrop for recovery. Between appointments, take the opportunity to explore Kalamata's rich history and vibrant culture, sampling delicious local cuisine and wandering through charming old town streets. Embrace the laid-back Mediterranean lifestyle, soaking in the warm sunshine and friendly atmosphere that permeates the city. With direct flights from major European cities and our clinic's convenient location, combining dental appointments with leisurely exploration of the region is a breeze. Choose Kalamata for your dental needs and embark on a journey that not only enhances your smile but also nourishes your soul.",
    "dental_tourism_todo_h3":"Decoding Kalamata: Unveiling the Secrets of its Popularity:",
    "dental_tourism_todo_title_nauvarino":"Costa Nauvarino",
    "dental_tourism_todo_p_nauvarino":"Discover Costa Navarino in Kalamata, a hidden gem nestled along the captivating coastline of Greece. With its pristine beaches, lush olive groves, and azure waters, this destination offers a serene retreat for travelers seeking both relaxation and adventure. From exploring ancient ruins to indulging in local delicacies, Costa Navarino in Kalamata promises an unforgettable experience steeped in rich history and natural beauty. Click ",
    "dental_tourism_todo_p_nauvarino_here":"here",
    "dental_tourism_todo_p_nauvarino_end":"to uncover more about the wonders awaiting you in this picturesque paradise.",
    "dental_tourism_todo_title_castle":"The Castle Of Kalamata",
    "dental_tourism_todo_p_castle":"Perched atop a rugged hill overlooking the charming town of Kalamata, the Kalamata Castle stands as a timeless sentinel of history. With its ancient walls whispering tales of conquests and resilience, the castle offers visitors a glimpse into the region's storied past. From its strategic vantage point, one can marvel at panoramic views of the Messinian Gulf while immersing themselves in the echoes of bygone eras. Click to delve deeper into the secrets held within the walls of this majestic fortress.",
    "dental_tourism_todo_title_museum":"Archaeological Museum of Messinia",
    "dental_tourism_todo_p_museum":"Step into the past at the Archaeological Museum of Kalamata, where ancient artifacts and treasures unveil the rich tapestry of the region's history. From intricately crafted pottery to majestic sculptures, each exhibit offers a window into the lives of those who once walked these lands. Located in the heart of Kalamata, this museum serves as a cultural oasis, preserving and celebrating the legacy of civilizations past.",
    "dental_tourism_todo_p_museum_end":"For more info click",
    "dental_tourism_todo_p_museum_here":"here!",
    "dental_tourism_todo_title_outdoor":"Outdoor Activities",
    "dental_tourism_todo_p_outdoor":"Embark on an outdoor adventure in Kalamata, where the stunning natural landscape beckons to be explored. Hike through verdant trails, where the scent of pine fills the air and breathtaking vistas await around every corner. Feel the rush of adrenaline as you kayak along the crystal-clear waters of the Messinian Gulf or dive into the depths for an unforgettable snorkeling experience. With its temperate climate and diverse terrain, Kalamata offers endless opportunities for outdoor enthusiasts to reconnect with nature and create lasting memories. Click",
    "dental_tourism_todo_p_outdoor_here":"here",
    "dental_tourism_todo_p_outdoor_end":"to discover the myriad of outdoor activities waiting to be enjoyed in this picturesque paradise.",
    "dental_tourism_conclusion_p":"In conclusion, selecting Kalamata for your dental tourism journey extends an invitation to a holistic experience – an amalgamation of top-tier healthcare, breathtaking landscapes, vibrant cultural immersion, and a rejuvenating lifestyle. Your dental adventure here guarantees more than just a brighter smile; it promises an indelible chapter in the heart of Greece, where your oral health and travel aspirations converge seamlessly. For prices click",
    "dental_tourism_conclusion_here":"here!",
    "dental_tourism_conclusion_p1":"Your Smile, Our Priority!",
    "dental_tourism_experience_span":"Dental Experience",
    "dental_tourism_experience_year":"Years",
    "dental_tourism_clients_span":"Dental Customers",
    "dental_tourism_prices":"For Prices",
    "dental_tourism_prices_clik_span":"Click here!",


    "blog_mainpage_span":"News & Blog",
    "blog_mainpage_title":"Stay tuned with our Latest News!",
   
    "blog_allpage_span":"Blog",
    "blog_allpage_header":"Our Blog",
    "blog_allpage_more":"Read More",
    "blog_allpage_pediatric_title":"Pediatric Dentistry",
    "blog_allpage_pediatric_p":"Many of us have suffered from teeth pains at an early age. More...",

    "blog_page_pediatric_title":"Pediatric Dentistry",
    "blog_page_pediatric_p":"Many of us have suffered as kids from tooth-ache, which made even our school concentration very difficult. There is no need to repeat the same story to our children. There are certain guidelines we can follow as parents to prevent the suffering of our child from carious teeth:",
    "blog_page_pediatric_limit_title":"Limiting the consumption of sugary foods",
    "blog_page_pediatric_limit_p":"No child can resist sweets. Parents, however, can arrange for them to be consumed immediately after a meal. The presence of sugar in the oral cavity for the whole day favors the growth of bacteria responsible for tooth decay. Especially with children using baby bottles, parents need to be very careful with the bottle content and the time of consumption. Even milk and juices contain sugar. Water is the best drink between meals.",
    "blog_page_pediatric_everyday_title":"Daily brushing of teeth",
    "blog_page_pediatric_everyday_p":"Even from infancy we have to clean our baby’s mouth after meals with water and special gauze available in pharmacies. Later, when the first teeth come out, we use the special children’s toothbrushes with soft heads and a bit of toothpaste (the size of a pea). It is advisable to brush our children’s teeth together, to make sure they apply effectively oral hygiene.",
    "blog_page_pediatric_appointment_title":"Pay a visit to the dentist",
    "blog_page_pediatric_apointment_p":"By the time of his/her first birthday a visit to the dentist is necessary to make our child familiar with his/her oral hygiene. Dental check-up and fluoride application are basic steps for a healthy smile. Deciduous dentition will start to be replaced by the permanent one at the age of 5-6 years. This does not mean that you should not take care of the first teeth. Harmful effects of caries can be continued to the permanent teeth. What is more, the dentist can tell us in a relatively early stage whether our child will need braces or not.",
    "blog_page_pediatric_conclusion_p":"Finally, when the first permanent teeth come out, they may need to be covered with preventive fillings (sealants) in order to smooth intense surface tooth morphology (grooves etc.), where trapped food and bacteria could cause tooth decay. The visit to the dentist solves many questions and offers several prevention and care tips.",

    "blog_allpage_preventive_title":"Preventive Dentistry",
    "blog_allpage_preventive_p":"It refers to the specialization of dental science that is related. More...",
    "blog_page_preventive_dentistry_title_header":"Preventive Dentistry",
    "blog_page_preventive_dentistry_title":"Best cure is prevention",
    "blog_page_preventive_dentistry_h4":"Hippocrates, 460-370 BC",
    "blog_page_preventive_dentistry_p":"Modern medical science has enormously evolved in curing the disease and neglects to give out information of how to prevent it. From Hippocrates, the father of medicine to the distant civilizations of India and China, there are scripts that clearly show and support the value of prevention for our health. In dentistry the same rule applies, especially considering the fact that many of the oral problems of are not only painful, but also interrelated with our overall health. Apart, then, from the daily practice of oral hygiene, visiting our dentist once or twice a year for a check-up is considered of a significant importance. Especially for younger patients who still have not fully developed their dentition, the dental check-up aims to strengthen the tooth enamel with fluoride treatment and to protect the first permanent teeth by preventive sealants without any removal of tooth substance.",
    "blog_page_preventive_dentistry_ul_title":"Does that mean, then, it’s time to shield your health?",
    "blog_page_preventive_dentistry_li_1":"Sports Splints",
    "blog_page_preventive_dentistry_li_2":"Sleep Apnea",

    "blog_page_preventive_dentistry_splints_title":"Sports Splints",
    "blog_page_preventive_dentistry_splints_p":"Doing sports, not only benefits our health, but also gives us the confidence and the psychological relief of everyday stress. The more committed to the goal the athlete is, the better performance he has. However, the excessive enthusiasm often leads to injuries and accidents. The sports splint is designed to absorb shocks and distribute the forces that the oro-maxillofacial system accepts, reducing injuries of the soft and hard tissues. An athlete is 60 times more likely to injure his teeth if not wearing a protective splint.",
    "blog_page_preventive_dentistry_splints_p1":"An athlete is 60 times more likely to injure his teeth if not wearing a protective splint. The American Dental Association recommends the use of customized splints for any athletic activity which involves a risk of injury, not only for contact sports, but also for individual sports such as gymnastics and skateboarding. Although there are several types of splints in the market, not all of them provide the necessary adjustment or protection. Even casts that are heated by hot water to soften so they can be fitted in the mouth, they fall far from protecting as they lack thickness and often do not cover the whole dentition. The best splint remains the customized- one, that is exclusively made for you by your dentist using an accurate impression of your teeth. Proper sports stent is a favorable cost-benefit tool that can save us from long-term dental services, suffering, anxiety and pain.",

    
    "blog_page_preventive_dentistry_apnea_what_title":"What is sleep apnea;",
    "blog_page_preventive_dentistry_apnea_what_p":"The sleep apnea syndrome is a common disorder of breathing and refers to the 5% of the general population (as frequent as asthma or diabetes). Potentially it is linked to several health problems and can be fatal.",
    "blog_page_preventive_dentistry_apnea_reasoning_title":"Rationale",
    "blog_page_preventive_dentistry_apnea_reasoning_p":"Apnea, due to the interruption of air flow in the airway, lasts more than 10 minutes. Apneas, depending on their etiology, are classified as obstructive, central or mixed. The most common form is obstructive apnea due to narrowing of the ex-thoracic air tubes.",
    "blog_page_preventive_dentistry_apnea_symptoms_title":"Symptoms",
    "blog_page_preventive_dentistry_apnea_symptoms_li1":"Snoring",
    "blog_page_preventive_dentistry_apnea_symptoms_li2":"Choking during sleep",
    "blog_page_preventive_dentistry_apnea_symptoms_li3":"Morning headache",
    "blog_page_preventive_dentistry_apnea_symptoms_li4":"Nocturia",
    "blog_page_preventive_dentistry_apnea_symptoms_li5":"Daytime sleepiness fatigue- prevents you from having a normal life",
    "blog_page_preventive_dentistry_apnea_symptoms_li6":"Sexual dysfunction",
    "blog_page_preventive_dentistry_apnea_symptoms_li7":"Cognitive disorders",
    "blog_page_preventive_dentistry_apnea_symptoms_li8":"Psychological disorders, depression, etc.",
    "blog_page_preventive_dentistry_apnea_symptoms_p":"Individuals with a high risk of developing the syndrome are obese and people with craniofacial abnormalities (macroglossia, micrognathia, enlarged tonsils, etc.). Other diseases such as hypothyroidism, myopathies, heart failure, stroke and several neurological syndromes are also directly associated with apnea.",
    "blog_page_preventive_dentistry_apnea_dealing_title":"Therapeutic strategy",
    "blog_page_preventive_dentistry_apnea_dealing_p1":"The diagnosis comes out the medical history, the physical examination and a multi-metric sleep study done in specialized sleep laboratories. Depending on the type of apnea the appropriate treatment is given. In mild forms of the syndrome, small lifestyle changes such as losing weight, avoiding alcohol and non-supine sleeping can help effectively. When however, serious attacks of apnea occur, the application of a specific continuous positive airway pressure device, which gently blows air through the nostrils and mouth to keep the back of the throat open during sleep (with special nasal CPAP mask), is the most effective therapy. Surgical treatment of the syndrome is decided in very limited and specific cases.",
    "blog_page_preventive_dentistry_apnea_dealing_p2":"The contribution of the specialist-prosthodontist can be catalytic from diagnosis to treatment. With special customized intraoral appliances, the mandible is stabilized so that the anatomical molecules do not block the airway, helping the patient to have a normal and comfortable sleep. These intraoral devices are perfectly comfortable and user-friendly, according to testimonies of the patients themselves. They are often used in healthy people for the treatment of snoring. In any case, medical monitoring is necessary for a device to be adapted to the individual needs of each person.",
    

    "blog_allpage_white_smile_secrets_title":"7 Secrets for all white smile",
    "blog_allpage_white_smile_secrets_p":"Think before you drink They may contain antioxidants that fight...",
    "blog_white_smile_secrets_before_title":"Think before you drink",
    "blog_white_smile_secrets_before_p":"They may contain antioxidants that fight some diseases, but a glass of red wine, cranberry juice or grape juice stain teeth easily. This does not mean that you should remove them from your diet, but remember to rinse your mouth after consumption.",
    "blog_white_smile_secrets_foods_title":"Foods that stain teeth",
    "blog_white_smile_secrets_foods_p":"There is another reason to take care of what you eat. Dentists declare there is an easy way to determine whether commonly consumed food is candidate for discoloring teeth. Anything can stain a white cotton T-shirt can stain teeth also. Coffee, tea, dark beverage and fruit juices are the most common. The stains gradually grown and become more pronounced as we age.",
    "blog_white_smile_secrets_smoke_title":"Do not smoke",
    "blog_white_smile_secrets_smoke_p":"Smoking is not only bad for our health but is also one of the worst factors staining teeth. Cigars and cigarettes cause brown stains that are difficult to remove only by brushing. The longer you smoke the more intense are the stains. Smoking also causes bad breath and gum disease and increases the risk for most kinds of cancer.",
    "blog_white_smile_secrets_house_title":"Homemade solutions for whiter teeth",
    "blog_white_smile_secrets_house_p":"Some people still prefer the old homemade ” remedies ” of brushing with baking soda for tooth whitening at home. Also, some foods like celery, apples, pears and carrots produce saliva that helps to remove food particles from the teeth. Chewing gum without sugar is actually a cleaning action for your dentition and also causes the production of saliva. The benefit is that saliva neutralizes acid that causes damage to the teeth. Regarding the teeth, the excess saliva is beneficial.",
    "blog_white_smile_secrets_touthpaste_title":"Whitening toothpaste",
    "blog_white_smile_secrets_touthpaste_p":"How can we remove stains from our teeth? There are toothpastes, gels and liquids in the market to help remove some surface stains. Many of these products contain light abrasives, chemical or other agents that help polishing the teeth.",
    "blog_white_smile_secrets_pills_title":"Medications",
    "blog_white_smile_secrets_pills_p":"Tetracycline is an antibiotic that leads to gray shade of children’s teeth. Antibacterial mouthwashes containing chlorhexidine or cetylpyridinium chloride substances may also stain teeth. Some antihistamines, antipsychotics and blood pressure drugs, iron and the excessive use of fluorine can also cause stains on teeth.",
    "blog_white_smile_secrets_dialy_title":"Do not forget daily care",
    "blog_white_smile_secrets_dialy_p":"A simple strategy that can help keeping teeth white is “Brushing”. You need at least two times a day and floss at least once daily. Even better, brush after every meal and snack. Brushing helps prevent stains and yellow teeth.",

    "blog_allpage_mouth_smell_title":"Why does my mouth smell?",
    "blog_allpage_mouth_smell_p":"Bad smell of our mouth in the morning results mainly due to...",
    "blog_mouth_smell_title":"Why does my mouth smell?",
    "blog_mouth_smell_p":"Bad smell of our mouth in the morning results mainly due to decreased production of saliva (dry mouth), which normally occurs during sleep.  Saliva is necessary for the removal of food residues from the oral cavity. Dry mouth combined with blood resting still while sleeping (because of the supine position), leads to the spread of bacteria found in the oral cavity. That produces compounds which are responsible for the bad odor of the breath.",
    "blog_mouth_smell_p1":"Dry mouth may nevertheless be the symptom of another disease such as:",
    "blog_mouth_smell_li":"renal deficiency ",
    "blog_mouth_smell_li1":"autoimmune disease (e.g. Sjӧgren syndrome)",
    "blog_mouth_smell_li2":"medication (e.g., allergy)",
    "blog_mouth_smell_p2":"Snoring and mouth breathing results in more dryness of the oral cavity and consequently leads to the bad smell of the mouth in the morning. The odor may also be associated with dental problems, especially periodontal disease (gingivitis, periodontitis) due to bacteria’s accumulation. Other diseases that may be related to bad smell are allergies (when occurring frequently), diabetes, liver problems and gastroesophageal reflux.",

    "blog_allpage_mouth_brush_title":"How can I properly brush my teeth?",
    "blog_allpage_mouth_brush_p":"Brushing makes our breath fresh and...",
    "blog_mouth_brush_title":"How can I properly brush my teeth?",
    "blog_mouth_brush_p1":"Brushing makes our breath fresh and cool. It also protects our teeth from decay and gum diseases. However, to be 100% effective, it must be carried out correctly and at least twice a day. The basic tools for proper brushing is the toothbrush and the dental floss or the interdental brushes. First, select a simple toothbrush with medium and flexible heads. Your dentist can advise you on the right choice. Our toothbrush needs to be replaced every 3-4 months. If your toothbrush hardens earlier you brush very hard and this way you might injure oral tissues. Use a toothpaste containing fluoride to strengthen the tooth enamel.",
    "blog_mouth_brush_p2":"It is better the floss to be waxed, so you can pass it easily between the interdental spaces. Ask your dentist to show you the flossing technique. Regardless of the way you brush, the aim is to eliminate bacteria that accumulate at the junction of teeth with gums, with mild and gentle movements in order to avoid teeth abrasion and gingival recession. Brushing takes at least two minutes in order to clean all tooth surfaces, which is the surface that is visible in the mirror, the one we chew on, the one that rests on the tongue and the areas that exist interdentally. Finally do not forget to brush your tongue as well.",

    "blog_allpage_implants_pain_title":"I've heard that implant’s placement hurt, is it true?",
    "blog_allpage_implants_pain_p":"The surgical procedure is...",
    "blog_main_implants_pain_title":"I've heard that implant’s placement hurt, is it true?",
    "blog_main_implants_pain_p":"The surgical procedure is simple and easy, especially compared with a tooth extraction and completely painless, under local anesthesia. The post-operative healing period depends mainly on the size of the operation. Simple analgesics the same day and the next 2-3 days typically cover the patient. Differentiation can occur in the diet of the patient in the first days to avoid post-operative complications, in case of the placement of multiple implants. Whatever the extent of the surgery, in the hands of a trained dentist, a high quality result can be obtained without pain and complications, with the compliance of the patient in the post-operative instructions of course.",

    "blog_allpage_implants_rejection_possibility_title":"Is it true that my body may not accept dental implants?",
    "blog_allpage_implants_rejection_possibility_p":"The probability of failure of...",
    "blog_main_implants_rejection_possibility_title":"Is it true that my body may not accept dental implants?",
    "blog_main_implants_rejection_possibility_p":"The probability of failure of implantation according to published studies is minimal in the hands of an experienced doctor, who is capable of:",
    "blog_main_implants_rejection_possibility_li1":"processing the information derived from the detailed medical and dental history of the patient in order to predict possible complications",
    "blog_main_implants_rejection_possibility_li2":"executing the surgery in a predictable way.",
    "blog_main_implants_rejection_possibility_p1":"Long -term functional stability of the implant depends on:",
    "blog_main_implants_rejection_possibility_li3":"the proper restoration placed above implants, that is a crown, bridge or denture.",
    "blog_main_implants_rejection_possibility_li4":"the oral hygiene, followed by the patient, which consists of the daily oral cleaning and the recalls, scheduled by the doctor. Therefore everyone has the same “tasks” either with or without implants in his mouth.",
    "blog_main_implants_rejection_possibility_li5":"the general health of the patient, since many diseases affect both teeth and implants.",

    "blog_allpage_wisdom_tooth_extraction_title":"Is it of vital importance that I extract my “wisdom teeth”?",
    "blog_allpage_wisdom_tooth_extraction_p":"The presence of wisdom teeth might cause...",
    "blog_main_wisdom_tooth_extraction_title":"Is it of vital importance that I extract my “wisdom teeth”?",
    "blog_main_wisdom_tooth_extraction_p":"The presence of wisdom teeth might cause some adverse conditions that make their extraction inevitable, such as:",
    "blog_main_wisdom_tooth_extraction_li1":"Local or diffuse neuralgia",
    "blog_main_wisdom_tooth_extraction_li2":"Damage to nearby teeth (caries, root or bone absorption)",
    "blog_main_wisdom_tooth_extraction_li3":"Pericoronitis (inflammation of the mucosa covering the wisdom tooth with pain, discharge of pus, etc.)",
    "blog_main_wisdom_tooth_extraction_li4":"Causing or worsening orthodontic abnormalities",
    "blog_main_wisdom_tooth_extraction_li5":"Provoking of pathological conditions (cysts, etc.)",
    "blog_main_wisdom_tooth_extraction_li6":"Inhibiting a partial or a full denture to “fit in”.",
    "blog_main_wisdom_tooth_extraction_p1":"Since no one can guarantee that a healthy wisdom tooth without symptoms will not create future problems, the choice of its removal or not should be made after consideration of all the above. The younger the patient is the better the outcome of an operation that will be downsized in time and certainly will have easier post-operative healing period.",

    "blog_allpage_dentist_first_title":"When shall I take for the first time my child to the dentist?",
    "blog_allpage_dentist_first_p":"The visit to the dentist causes fear in most of...",
    "blog_main_dentist_first_title":"When shall I take for the first time my child to the dentist?",
    "blog_main_dentist_first_p":"The visit to the dentist causes fear in most of them and is treated as “necessary evil”. In order to avoid sharing the same phobias from our childhood with our kids, it is important to “make acquaintance” with the oral hygiene and the dentist from an early age. Since its infancy, even before the appearance of the first teeth, we are supposed to clean the baby’s gums after eating with a special toothbrush. It is important is to announce this tusk with enthusiasm “Now you’re going to brush our teeth!!!” in order our child will finally embrace this good habit. The American Academy of Pediatric Dentistry recommends that children should pay their first visit to the doctor at the age of one year’s old. The dentist should be specialized in dental treatment of children and adolescents, so that you can be sure that your child will feel comfortable and familiar with the clinic. In the first visit your child will be checked for traces of teeth caries. Although children’s first teeth will soon be replaced by the permanent ones, they must stay healthy until that time, in order to reserve a healthy space for the eruption of permanent teeth that grow underneath. At the age of 5-6 year’s old, the child’s dentition begins to get replaced, and that is when the dentist will determine the need for referral to an orthodontist to prevent future problems. Therefore do not neglect your child’s appointment with the dentist.",

    "blog_allpage_prp_facelift_title":"Is the PRP- mesotherapy treatment safe?",
    "blog_allpage_prp_facelift_p":"This modern anti-aging treatment uses our...",
    "blog_main_prp_facelift_title":"Is the PRP- mesotherapy treatment safe?",
    "blog_main_prp_facelift_p":"This modern anti-aging treatment uses our own blood and utilizes its healing and regenerative properties. Therefore there is no risk of infection, allergy or other reactions. The PRP method rebuilds the skin naturally and eliminates wrinkles not by “filling” them with foreign substances in the body, but refreshing the skin from within: collagen and hyaluronic acid are produced by fibroblasts of the organization itself, so the filling of wrinkles occurs gradually and lasts over time. There are of course some health conditions (eg haematological disorders) you should talk about with the doctor which might be contraindications for the implementation of the method.",

    "blog_allpage_cbct_title":"Cone Beam Computed Tomography(CBCT)",
    "blog_allpage_cbct_p":"Three-dimensional radiographic imaging is a scientific achievement with...",
    "blog_main_cbct_title":"Cone Beam Computed Tomography(CBCT)",
    "blog_main_cbct_p1":"Three-dimensional radiographic imaging is a scientific achievement with many advantages, offering a more accurate and safer diagnostic tool. Today, three-dimensional radiographic imaging through Cone Beam Computer Tomography (CBCT) in modern dental practice is a valuable diagnostic tool, particularly in cases of anatomical challenges encountered in implant planning or general dental treatments (e.g., the inferior alveolar nerve, nasal and paranasal sinuses). Proper and accurate planning protects the patient while also providing unique treatment planning protocols and loading strategies for dental implants. The much greater imaging accuracy compared to a traditional Dental CT allows for the digital placement of implants on a computer using data from the radiograph, facilitated by specialized software. This ensures more precise planning and enhances patient safety.",
    "blog_main_cbct_p2":"Thus, this machine could be considered a valuable diagnostic and communication tool, as the treatment plan can now be presented tangibly to the patient before execution. This ensures safety, comfort, rapid recovery, and more accurate imaging and planning (immediate loading – same day teeth). The low radiation dose, nearly equivalent to that of a panoramic X-ray machine, combined with the very short exposure time compared to a conventional CT scan, represents a technological advancement primarily aimed at dental patients, as it minimizes their radiation exposure while providing much more accurate imaging capabilities than other devices. The machine can focus radiation solely on the cranial area, specifically the jaws and maxillary sinuses, making it suitable for dental use only. Its potential applications span every dental field, from general to specialized dentistry, wherever detailed jaw imaging is necessary.",
    "blog_main_cbct_p3":"Its use is intended both for patients needing dental-type X-rays and for dentists who can utilize it for diagnostic purposes in a limited field, providing more accurate imaging in cases such as endodontics, temporomandibular disorders, or even a simple panoramic X-ray, among others. The application of three-dimensional Cone Beam Computed Tomography (CBCT) is not limited to implantology but extends to every area of dentistry, making it a valuable and essential diagnostic tool today.",
    "blog_main_cbct_advantages_title":"Advantages of CBCT",
    "blog_main_cbct_advantages_p1":"A CT scanner designed exclusively for dental use, with applications in implantology, endodontics, orthodontics, periodontology, and oral surgery. Anteroposterior and lateral cephalometric X-rays can be derived from a single initial CT scan, further reducing radiation exposure for the patient, especially when these imaging methods are necessary for young patients undergoing orthodontic treatment. It offers very low radiation exposure, comparable to a simple panoramic X-ray but with three-dimensional imaging. The radiation dose is 20 to 50 times lower than that of conventional CT scans. It also provides a very thin slice thickness, 5 to 15 times smaller than that of a traditional CT scan, where indicated (digital treatment planning – guided surgery).",
    "blog_main_cbct_advantages_p2":"The ability to digitally read and modify volumetric data in the dental office by the referring dentist allows for precise 1:1 measurements, focusing on either the upper or lower jaw depending on the occlusal plane, or even a single tooth without the distortion present in panoramic X-rays. It offers a very small focal spot and high resolution. The field of view is larger compared to a panoramic X-ray (6-12 inches). The imaging is simple, safe, accurate, fast, and provides more detailed three-dimensional images. The actual exposure time is minimal since the radiation is pulsed and adjusted based on the patient's size (40% less radiation for children than adults). Multiple 360-degree images are captured with a single simple rotation using cone-beam radiation, whereas in traditional CT scans, the patient is typically irradiated transversely with multiple rotations. The digital design of the treatment plan serves as a communication tool between the dentist and the patient.",



    "blog_tourism_sidebar_upcomingevents":"Upcoming Events:",
    "blog_tourism_sidebar_popularevents":"Most Popular Events:",

    
   

    "blog_full_mouth_rest_long_title":"How long can my full-mouth reconstruction can last?",
    "blog_full_mouth_rest_long_p":"The future timeline for a full-mouth reconstruction will vary, as it does with all patients, depending on your personal factors, oral structure, health, and the type of procedures you undergone. However, many of the most commonly used reconstruction options have a lifespan of at least a decade. These options include veneers, dental implants, crowns, and bridges, all of which can last ten years or more if patients take the proper care. Proper care, of course, involves daily hygiene habits such as brushing, flossing, and rinsing. Another integral component is scheduling routine check-ups and cleanings. After your full-mouth reconstruction, a follow-up appointment will allow us (or your general dentist) to check that everything is comfortable and that your bite is functional and does not give you any trouble. Additionally, our doctors can provide tips and tricks for correct care to help you extend the lifespan of your reconstruction or make any necessary alterations if you aren't pleased with your results. Then, through routine check-ups, we can monitor your progress, provide professional cleanings, and evaluate the integrity of any implants, fixtures, or veneers.",
   
    "blog_bonecrafts_title":"",
    "blog_bonecrafts_p":"",
    "blog_autografts_title":"",
    "blog_autografts_question_p":"",
    "blog_autografts_p":"",
    "blog_bonecrafts_meeting_title":"",
    "blog_bonecrafts_meeting_p":"",
    "blog_sinuslift_title":"",
    "blog_sinuslift_meeting_p":"",
    "blog_bonecrafts_guided_title":"",
    "blog_bonecrafts_guided_p":"",

    "blog_implants_after_surgery_main_title":"After surgery instructions",
    "blog_implants_after_surgery_bleeding_title":"Bleeding",
    "blog_implants_after_surgery_bleeding_p":"Mild bleeding or redness of the saliva is normal and expected for 24 hours. Apply steady, continuous pressure with a gauze pad locally. Bite down on the gauze for 30 minutes and repeat if you deem it necessary. This will likely control the bleeding. A small amount of blood discharge is normal for the first few days. Avoid smoking, drinking through a straw, rinsing, or taking aspirin, as these may disturb the clot, causing the bleeding to restart. In such a case, take a semi-upright position using two pillows. If the bleeding is not controlled, please contact the dental clinic immediately. Do not sleep with the gauze in your mouth as you may accidentally swallow it.",
    "blog_implants_after_surgery_swelling_title":"Swelling",
    "blog_implants_after_surgery_swelling_p":"Swelling is normal and expected after any surgical procedure. Apply ice to the area for the first 36 hours. Use an ice pack for 20 minutes, then remove it for the next 20 minutes, and repeat accordingly. Ice has little effect after the first 24 hours, but it can still provide relief. Swelling reaches its peak 48-72 hours postoperatively. Any difficulties in opening the mouth that may occur are expected to subside soon. The application of warm compresses 72 hours after surgery increases local circulation and helps reduce swelling. Warm compresses should not be used for more than 3 days. Swelling usually lasts about a week. To improve the swelling, take:",
    "blog_implants_after_surgery_swelling_p_algofren":"Algofren 600 mg 3 times a day for 4-5 days.",
    "blog_implants_after_surgery_contamination_title":"Infection",
    "blog_implants_after_surgery_contamination_p":"In healthy patients, the risk is extremely low. In case of infection, antibiotics and a mouthwash will be prescribed. If you experience an allergic reaction, please stop taking the medication immediately and contact the dental clinic.",
    "blog_implants_after_surgery_contamination_p_amoxil":"Amoxil 500 mg, 3 times a day for 4-5 days.",
    "blog_implants_after_surgery_motion_title":"Pain",
    "blog_implants_after_surgery_motion_p":"Pain is completely expected and varies from patient to patient. It is usually at its peak 48-72 hours postoperatively and then decreases. In case of mild pain, you may take a pain reliever, except aspirin, as it prevents clot formation and may cause bleeding. Painkillers may cause dizziness. Please do not drive or undertake any important tasks while under their influence. They should not be taken on an empty stomach. If the pain is not relieved, please contact the dental clinic.",
    "blog_implants_after_surgery_motion_p_panadol":"Panadol Extra / Depon, maximum 4 times a day for pain.",
    "blog_implants_after_surgery_dizy_title":"Nausea",
    "blog_implants_after_surgery_dizy_p":"It is expected postoperatively due to swallowing blood. A small amount of carbonated drinks every hour for the first 5-6 hours usually provides relief. Painkillers may cause nausea. In the case of bone grafts, strictly avoid carbonated beverages.",
    "blog_implants_after_surgery_diet_title":"Diet",
    "blog_implants_after_surgery_diet_p":"Consume plenty of fluids. Avoid hot drinks or foods. A light diet (rice, well-cooked vegetables, meat, crustless bread, mashed potatoes) is recommended on the day of the surgery and for 1 week. Soft foods that are high in vitamins and proteins can also be followed. Avoid hard foods that may irritate the area, sticky foods, or chewing gum. Continue with your regular diet as soon as possible. Foods such as milk, soups, soft cereals in broth, etc., are recommended. However, acidic foods such as tomatoes, orange juice, and citrus fruits should be avoided. Finally, alcohol is not recommended.",
    "blog_implants_after_surgery_hygiene_title":"Oral Hygiene",
    "blog_implants_after_surgery_hygiene_p":"Do not rinse your mouth vigorously for the first day after the surgery, as the clot may dissolve, causing bleeding. From the second day, use mouthwash twice a day. Warm salt water can also be used 4-5 times a day immediately after meals. Initially, brush the teeth around the surgical area gently and softly. After the first week, you can brush the healing screw with a cotton swab dipped in chlorhexidine twice a day. In general, avoid regular brushing or flossing around the implants for the first 2 weeks.",
    "blog_implants_after_surgery_activity_title":"Activity",
    "blog_implants_after_surgery_activity_p":"Keep any physical activity to a minimum immediately after the surgery, as it may cause bleeding. Consider that you are not fully nourished, which may further limit your ability to exercise.",
    "blog_implants_after_surgery_smoking_title":"Smoking",
    "blog_implants_after_surgery_smoking_p":"Avoid smoking 1 week before the procedure. Avoid or reduce it during the healing process, as it is a major irritant, increases the risk of infection, and delays healing. Keep your lips and the corners of your mouth moist with petroleum jelly if they have been injured after the surgery. If non-absorbable stitches have been used, they will be removed at the next follow-up appointment. Antibiotics and contraceptives can sometimes interact. If you have any concerns, please do not hesitate to contact us.",

    "blog_implants_dailycare_title":"Daily Care",
    "blog_implants_dailycare_p":"The implant therapy offers unmatched aesthetics and function, similar to what you once had with your natural teeth! Implants require daily care to ensure a healthy peri-implant environment.",
    "blog_implants_dailycare_general_title":"Generally",
    "blog_implants_dailycare_general_p":"The toothbrush is the key to a bright future without worries or problems regarding implants. It is just as important to clean the implants as it is your natural teeth. A toothbrush with a low abrasive ability is recommended, along with a daily hygiene routine to keep all surfaces clean at all times.",
    "blog_implants_dailycare_bridges_title":"Single crown – bridge, daily care.",
    "blog_implants_dailycare_bridges_p":"Important cleaning areas:",
    "blog_implants_dailycare_bridges_li1":"The gum line, above and below it",
    "blog_implants_dailycare_bridges_li2":"The interproximal spaces",
    "blog_implants_dailycare_guide_general_title":"Daily Care Guide",
    "blog_implants_dailycare_guide_toothbrush_title":"Toothbrush",
    "blog_implants_dailycare_guide_toothbrush_p":"You may need to modify the toothbrush for the inner sides of the restoration or for hard-to-reach areas. An electric toothbrush is also a good alternative and is easy to use, offering the same cleaning results. If you have a bridge, remember to clean the areas underneath it.",
    "blog_implants_dailycare_guide_toothbrush_between_title":"Interdental Toothbrush:",
    "blog_implants_dailycare_guide_toothbrush_between_p":"A soft interdental toothbrush is an ideal cleaning solution for difficult areas around the implant, both lingually and on the adjacent surfaces, both circumferentially and externally.",
    "blog_implants_dailycare_guide_brushes_title":"Interdental Brushes:",
    "blog_implants_dailycare_guide_brushes_p":"These are available for the lateral interproximal areas or under the bridge. Use the brush gently with a back-and-forth motion while pressing against the surface of the implant crown. The brush should not be too small, as this would reduce the cleaning effectiveness, nor too large, as it could cause discomfort to the soft tissues. Never use a toothbrush in combination with the interdental brush, as its abrasive ability will multiply.",
    "blog_implants_dailycare_guide_floss_title":"Floss – Super Floss:",
    "blog_implants_dailycare_guide_floss_p":"Using floss in tight areas where teeth are in close contact with the implant restoration is a useful alternative to interdental brushes. Use relatively thick floss to pass back and forth between the tooth and the implant. Clean the bridge next to the gum line by pressing sideways.",
    "blog_implants_dailycare_guide_check_title":"Follow-ups:",
    "blog_implants_dailycare_guide_check_p":"Taking care of my teeth means following a regular schedule of personalized follow-ups. During the dental check-up, the results of your home care efforts are assessed, the implants are cleaned, and the occlusion is checked. Finally, once a year, X-rays are taken to monitor the long-term bone stability of the implants. Systematic use of mouthwash with chlorhexidine once a day, or up to three times as needed, is considered essential for your peri-implant health. Products such as Kingingival, Chlorhexil, Eludril, Perioxidin, Plackout, Hexalen, etc., can be used."
}

